{
  "name": "Adult Dungeon Dragon",
  "tags": [
    "huge",
    "dragon",
    "cr16",
    "tome-of-horrors"
  ],
  "size": "Huge",
  "type": "dragon",
  "alignment": "neutral",
  "cr": "16 (15,000 XP)",
  "hp": "364 (27d12 + 189)",
  "ac": "18 (natural armor)",
  "speed": "40 ft., fly 80 ft.",
  "saves": "Dex +5, Con +12, Wis +8, Cha +10",
  "skills": "Arcana +8, History +8, Insight +8, Investigation +13, Perception +13, Survival +8",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23",
  "languages": "all",
  "abilities": {
    "str": 27,
    "dex": 10,
    "con": 25,
    "int": 16,
    "wis": 17,
    "cha": 21
  },
  "traits": [
    {
      "name": "Special Equipment",
      "desc": "The dragon is attuned to a crystal ball, which is hidden somewhere within its labyrinthine lair. If a dungeon dragon loses its crystal ball, it can create a new one over the course of 10 days."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The dungeon dragon’s innate spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). It can cast the following spells, requiring no material components. * At will: <i>alarm, arcane lock, detect magic, detect thoughts, find traps, glyph of warding, identify, knock, scrying, stone shape, wall of stone</i> * 3/day each: <i>dispel magic, hallucinatory terrain, locate creature, locate object, project image</i>"
    },
    {
      "name": "Labyrinthine Recall",
      "desc": "The dungeon dragon can perfectly recall any path it has traveled."
    },
    {
      "name": "Legendary Resistance (3/day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Trap Master",
      "desc": "The dungeon dragon has advantage on saving throws against the effects of traps."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Frightful Presence and makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +13 to hit, reach 20 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon’s choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to the dragon’s Frightful Presence for the next 24 hours."
    },
    {
      "name": "Confusion Breath (Recharge 5–6)",
      "desc": "The dragon exhales gas in a 60-foot cone that spreads around corners. Each creature in that area must succeed on a DC 20 Constitution saving throw. On a failed save, the creature is confused for 1 minute. While confused, the creature uses its action to Dash in a random direction, even if that movement takes the creature into dangerous areas. A confused creature can repeat the saving throw at the end of each of its turns, ending the effect on a success."
    }
  ],
  "legendary": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a tail attack."
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "desc": "The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 21 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
    }
  ]
}