{
  "name": "Aetherspawn Paragon",
  "tags": [
    "medium",
    "elemental",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "elemental",
  "alignment": "unaligned",
  "cr": "5 (1,800 XP)",
  "hp": "91 (14d8 + 28)",
  "ac": "15 (natural armor)",
  "speed": "30 ft., fly 30 ft. (hover)",
  "saves": "Dex +7, Int +7",
  "skills": "Arcana +7",
  "resistance": "bludgeoning, piercing, slashing damage from nonmagical weapons; see Elemental Attunement",
  "conimmunities": "exhaustion, paralyzed, petrified, poisoned, unconscious",
  "senses": "passive Perception 12",
  "languages": "Primordial",
  "abilities": {
    "str": 12,
    "dex": 19,
    "con": 15,
    "int": 18,
    "wis": 15,
    "cha": 12
  },
  "traits": [
    {
      "name": "Elemental Attunement",
      "desc": "The paragon is infused with either arcane, ice, fire, or lightning energy. The paragon's attacks deal extra damage based upon this element (included in the attack), it has immunity to the corresponding element, and can cast a corresponding elemental spell twice per day requiring no material components. The paragon's spellcasting ability is Intelligence (spell save DC 15, +7 bonus to hit). * Arcane – bonus force damage and immunity to force damage; can cast <i>slow</i> * Ice - bonus cold damage and immunity to cold damage; can cast <i>sleet storm</i> * Fire – bonus fire damage and immunity to fire damage; can cast <i>fireball</i> * Lightning – bonus lightning damage and immunity to lightning damage; can cast <i>lightning bolt</i>"
    },
    {
      "name": "Elemental Mastery",
      "desc": "As a bonus action, the paragon can shift its Elemental Attunement to another element. Once the paragon has shifted to this element, it can't do so again until the next dawn. This does not refresh the paragon's two spells per day limit, but does change the spell available to be cast."
    },
    {
      "name": "Fracturing Death",
      "desc": "When the paragon dies, it explodes in a blast of chromatic energies that attempt to reform in four unoccupied spaces within 50 feet. At each of these spaces a glowing orb of pure elemental energy and runic stone glows and shifts – one orb for each of the four possible elements of an aetherspawn. These orbs have 15 hit points and AC 13. Roll for initiative with no bonus for each of these orbs and add them to the initiative order. Whenever it is the orb's turn, it transforms into a aetherspawn guardian of the corresponding element."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The paragon makes two melee attacks."
    },
    {
      "name": "Aether Claws",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage plus 7 (2d6) damage of the type corresponding to the paragon's Elemental Attunement."
    },
    {
      "name": "Elemental Shards",
      "desc": "Ranged Weapon Attack: +7 to hit, range 30/90 ft., one target. Hit: 9 (2d4 + 4) piercing damage plus 7 (2d6) damage of the type corresponding to the paragon's Elemental Attunement."
    },
    {
      "name": "Living Meteor (Recharge 5-6)",
      "desc": "The paragon transforms into a sphere of pure elemental energy and launches itself in a straight line to an unoccupied space up to 90 feet away. Each creature in the line must make a DC 15 Dexterity saving throw, taking 22 (5d8) damage of the type corresponding the paragon's Elemental Attunement on a failed save, or half as much damage on a successful one. Creatures within 5 feet of the paragon's final location make the save with disadvantage as the meteor erupts before the paragon returns to its ordinary form."
    }
  ]
}