{
  "name": "Ancient Fisherman",
  "tags": [
    "medium",
    "humanoid",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "neutral",
  "cr": "5 (1,800 XP)",
  "hp": "110 (13d10 + 39)",
  "ac": "16 (mithril chainmail)",
  "speed": "30 ft., swim 30 ft.",
  "saves": "Str +6, Wis +6",
  "skills": "Athletics +6, Nature +4, Perception +9, Survival +6",
  "senses": "passive Perception 19",
  "languages": "any three languages",
  "abilities": {
    "str": 17,
    "dex": 10,
    "con": 16,
    "int": 12,
    "wis": 16,
    "cha": 12
  },
  "traits": [
    {
      "name": "Aquatic Expert",
      "desc": "The fisherman can hold his breath for up to 10 minutes and his abilities are unimpeded when engaging in underwater combat."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The fisherman’s innate spellcasting ability is Wisdom (spell save DC 14). The fisherman can innately cast the following spells, requiring no material components: * At will: <i>dancing lights, shape water</i> * 1/day each: <i>control water, tidal wave, wall of water, watery sphere</i>"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The fisherman makes three attacks: one with his harpoon and two with his hook."
    },
    {
      "name": "Giant Hook",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5ft., one target. Hit: 7 (1d8 + 3) piercing damage."
    },
    {
      "name": "Harpoon",
      "desc": "Ranged Weapon Attack: +6 to hit, range 20/60 ft., one target. Hit: 6 (1d6 + 3) piercing damage and the target is grappled (escape DC 14). The fisherman may use his bonus action to pull the target up to 30 feet towards him, dealing an additional 9 (2d8) piercing damage. If the fisherman uses this attack with a target already grappled, the target is pulled up to an additional 30 feet and takes 9 (2d8) piercing damage. Whenever the grappled creature attempts to break free of the grapple, they immediately take 9 (2d8) piercing damage at the harpoon tears at them."
    },
    {
      "name": "Catch and Release (Recharge 5-6)",
      "desc": "The fisherman performs a vicious attack on a target grappled by his harpoon within 5 feet. He makes an attack roll with advantage using his giant hook. On a hit, he pierces through the target with the hook, then rips it from their body, dealing an additional 33 (6d10) piercing damage with the attack."
    }
  ]
}