{
  "name": "Ancient Dungeon Dragon",
  "tags": [
    "gargantuan",
    "dragon",
    "cr21",
    "tome-of-horrors"
  ],
  "size": "Gargantuan",
  "type": "dragon",
  "alignment": "neutral",
  "cr": "21 (33,000 XP)",
  "hp": "490 (28d20 + 196)",
  "ac": "19 (natural armor)",
  "speed": "40 ft., fly 80 ft.",
  "saves": "Dex +8, Con +14, Wis +10, Cha +11",
  "skills": "Arcana +12, History +12, Insight +10, Investigation +19, Perception +17, Survival +10",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 27",
  "languages": "all",
  "abilities": {
    "str": 27,
    "dex": 12,
    "con": 25,
    "int": 20,
    "wis": 17,
    "cha": 19
  },
  "traits": [
    {
      "name": "Special Equipment",
      "desc": "The dragon is attuned to a crystal ball, which is hidden somewhere within its labyrinthine lair. If a dungeon dragon loses its crystal ball, it can create a new one over the course of 10 days."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The dungeon dragon’s innate spellcasting ability is Charisma (spell save DC 19, +11 to hit with spell attacks). It can cast the following spells, requiring no material components. * At will: <i>alarm, arcane lock, detect magic, detect thoughts, find traps, glyph of warding, identify, knock, scrying, stone shape, wall of stone</i> * 3/day each: <i>dispel magic, hallucinatory terrain, locate creature, locate object, project image</i> * 1/day: <i>find the path, maze, mirage arcane, passwall</i>"
    },
    {
      "name": "Labyrinthine Recall",
      "desc": "The dungeon dragon can perfectly recall any path it has traveled."
    },
    {
      "name": "Legendary Resistance (3/day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Trap Master",
      "desc": "The dungeon dragon has advantage on saving throws against the effects of traps."
    },
    {
      "name": "Minotaur Meeting",
      "desc": "Minotaurs are strangely drawn to the area surrounding a dungeon dragon’s lair, often seeking to emulate the master of mazes."
    },
    {
      "name": "Weather Alteration",
      "desc": "Once per day, the dungeon dragon can alter the weather in a 6-mile radius centered on its lair. If the dragon dies these effects fade over 1d10 days."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Frightful Presence and makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +15 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +15 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +15 to hit, reach 20 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon’s choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to the dragon’s Frightful Presence for the next 24 hours."
    },
    {
      "name": "Change Shape",
      "desc": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon’s choice). In a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except for class features or legendary actions of that form."
    },
    {
      "name": "Confusion Breath (Recharge 5–6)",
      "desc": "The dragon exhales gas in a 90-foot cone that spreads around corners. Each creature in that area must succeed on a DC 22 Constitution saving throw. On a failed save, the creature is confused for 1 minute. While confused, the creature uses its action to Dash in a random direction, even if that movement takes the creature into dangerous areas. A confused creature can repeat the saving throw at the end of each of its turns, ending the effect on a success."
    },
    {
      "name": "Dominate",
      "desc": "One creature the dragon can see within 60 feet of it must succeed on a DC 19 Wisdom saving throw or be charmed for 1 hour. The creature has advantage if the dragon is fighting it. While the creature is charmed, the dragon has a telepathic link with it as long as it and the dragon are on the same plane of existence, and the dragon can issue commands to the creature as long as it is conscious (no action required), which it does its best to obey. The dragon can use an action to take total and precise control of the target. Until the end of the dragon’s next turn, the creature takes only the actions the dragon dictates and doesn’t do anything that the dragon does not allow it to. In addition, the dragon can also cause the creature to use a reaction, but this requires the dragon to use its reaction as well. The charmed creature can repeat the saving throw whenever it takes damage. If the saving throw succeeds, the spell ends."
    },
    {
      "name": "Illusory Terrain",
      "desc": "The dungeon dragon uses illusions to subtly manipulate creatures within its lair, as if it had cast the hallucinatory terrain, project image, or mirage arcane spell, targeting any location within its lair that it can see."
    },
    {
      "name": "Changing Maze",
      "desc": "The dungeon dragon manipulates the stone of its labyrinth as if it had cast the stone shape spell, targeting any location within its lair that it can see."
    },
    {
      "name": "Stone Walls",
      "desc": "The dungeon dragon creates walls of stone as if it had cast the wall of stone spell, targeting any location within its lair that it can see. When cast in this way, the dragon does not need to concentrate on the spell and its effects become permanent immediately."
    }
  ],
  "legendary": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a tail attack."
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "desc": "The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 23 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
    }
  ]
}