{
  "name": "Annis Hag",
  "tags": [
    "large",
    "fey",
    "cr6",
    "volos-guide"
  ],
  "size": "Large",
  "type": "fey",
  "alignment": "chaotic evil",
  "cr": "6 (2,300 XP)",
  "hp": "75 (10d10+20)",
  "ac": "17 (natural armor)",
  "speed": "40 ft.",
  "saves": "Con +5",
  "skills": "Deception +5, Perception +5",
  "resistance": "cold; bludgeoning, piercing, and slashing from nonmagical attacks",
  "senses": "darkvision 60 ft.",
  "languages": "Common, Giant, Sylvan",
  "abilities": {
    "str": 21,
    "dex": 12,
    "con": 14,
    "int": 13,
    "wis": 14,
    "cha": 15
  },
  "traits": [
    {
      "name": "Innate Spellcasting",
      "desc": "The hag's innate spellcasting ability is Charisma (spell save DC 13). She can innately cast the following spells: 3/day each: <i>disguise self</i> (including the form of a Medium humanoid), <i>fog cloud</i>"
    },
    {
      "name": "Hag Coven",
      "desc": "When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of the hags continues to desire more personal power. A coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos."
    },
    {
      "name": "Shared Spellcasting (Coven Only)",
      "desc": "While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells from the wizard's spell list but must share the spell slots among themselves. For casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12 + the hag's Intelligence modifier, and the spell attack bonus is 4 + the hag's Intelligence modifier. * 1st level (4 slots): <i>identify, ray of sickness</i> * 2nd level (3 slots): <i>hold person, locate object</i> * 3rd level (3 slots): <i>bestow curse, counterspell, lightning bolt</i> * 4th level (3 slots): <i>phantasmal killer, polymorph</i> * 5th level (2 slots): <i>contact other plane, scrying</i> * 6th level (1 slot): <i>eyebite</i>"
    },
    {
      "name": "Hag Eye (Coven Only)",
      "desc": "A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes 3d10 psychic damage and is blinded for 24 hours. A hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while blinded. During the ritual, if the hags take any action other than performing the ritual, they must start over."
    },
    {
      "name": "Variant: Death Coven",
      "desc": "For a death coven, replace the spell list of the hags' Shared Spellcasting trait with the folllowing spells: * 1st level (4 slots): <i>false life, inflict wounds</i> * 2nd level (3 slots): <i>gentle repose, ray of enfeeblement</i> * 3rd level (3 slots): <i>animate dead, revivify, speak with dead</i> * 4th level (3 slots): <i>blight, death ward</i> * 5th level (2 slots): <i>contagion, raise dead</i> * 6th level (1 slot): <i>circle of death</i>"
    },
    {
      "name": "Variant: Nature Coven",
      "desc": "For a nature coven, replace the spell list of the hags' Shared Spellcasting trait with the folllowing spells: * 1st level (4 slots): <i>entangle, speak with animals</i> * 2nd level (3 slots): <i>flaming sphere, moonbeam, spike growth</i> * 3rd level (3 slots): <i>call lightning, plant growth</i> * 4th level (3 slots): <i>dominate beast, grasping vine</i> * 5th level (2 slots): <i>insect plague, tree stride</i> * 6th level (1 slot): <i>wall of thorns</i>"
    },
    {
      "name": "Variant: Prophecy Coven",
      "desc": "For a prophecy coven, replace the spell list of the hags' Shared Spellcasting trait with the folllowing spells: * 1st level (4 slots): <i>bane, bless</i> * 2nd level (3 slots): <i>augury, detect thoughts</i> * 3rd level (3 slots): <i>clairvoyance, dispel magic, nondetection</i> * 4th level (3 slots): <i>arcane eye, locate creature</i> * 5th level (2 slots): <i>geas, legend lore</i> * 6th level (1 slot): <i>true seeing</i>"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The annis makes three attacks: one with her bite and two with her claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 15 (3d6+5) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 15 (3d6+5) slashing damage."
    },
    {
      "name": "Crushing Hug",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 36 (9d6+5) bludgeoning damage, and the target is grappled (escape DC 15) if it is a Large or smaller creature. Until the grapple ends, the target takes 36 (9d6+5) bludgeoning damage at the start of each of the hag's turns. The hag can't make attacks while grappling a creature in this way."
    }
  ]
}