{
  "name": "Apau Perape",
  "tags": [
    "large",
    "fiend",
    "cr6",
    "tome-of-beasts"
  ],
  "size": "Large",
  "type": "fiend",
  "alignment": "chaotic evil",
  "cr": "6 (2300 XP)",
  "hp": "95 (10d10 + 40)",
  "ac": "16 (natural armor)",
  "speed": "30 ft., climb 30 ft.",
  "saves": "Dex +7, Con +7, Wis +4",
  "skills": "Intimidation +5, Perception +4, Stealth +7",
  "immunities": "poison",
  "resistance": "fire, lightning, poison; bludgeoning, piercing, and slashing from nonmagical weapons",
  "vulnerability": "cold",
  "conimmunities": "frightened, poisoned",
  "senses": "darkvision 120 ft., passive Perception 14",
  "languages": "Ape, Infernal, telepathy 120 ft.",
  "abilities": {
    "str": 21,
    "dex": 18,
    "con": 19,
    "int": 10,
    "wis": 12,
    "cha": 15
  },
  "traits": [
    {
      "name": "Diseased Ichor",
      "desc": "Every time the apau perape takes piercing or slashing damage, a spray of caustic blood spurts from the wound toward the attacker. This spray forms a line 10 feet long and 5 feet wide. The first creature in the line must make a successful DC 15 Constitution saving throw against disease or be infected by Mechuiti's Ichor disease. The creature is poisoned until the disease is cured. Every 24 hours that elapse, the target must repeat the Constitution saving throw or reduce its hit point maximum by 5 (2d4). The disease is cured on a success. The target dies if the disease reduces its hit point maximum to 0. This reduction to the target's hit point maximum lasts until the disease is cured."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The apau perape is an innate spellcaster. Its spellcasting ability is Charisma (spell save DC 13). The apau perape can innately cast the following spells, requiring no material components: * 1/day each: <i>fear, wall of fire</i>"
    },
    {
      "name": "Magic Resistance",
      "desc": "The apau perape has advantage on saving throws against spells and other magical effects."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The apau perape makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one creature. Hit: 12 (2d6 + 5) piercing damage."
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) slashing damage."
    },
    {
      "name": "Variant: Demon Summoning",
      "desc": "Some apau perapes have an action option that allows them to summon other demons. Summon Demon (1/Day): The apau perape chooses what to summon and attempts a magical summoning The apau perape has a 50 percent chance of summoning one apau perape or one giant ape."
    }
  ]
}