{
  "name": "Baba Yaga",
  "tags": [
    "medium",
    "fey",
    "cr15",
    "homebrew"
  ],
  "size": "Medium",
  "type": "fey",
  "alignment": "chaotic evil",
  "cr": "15 (13,000 XP)",
  "hp": "153 (18d8 + 72)",
  "ac": "20",
  "speed": "30 ft., fly 60 ft.",
  "saves": "Wis +8, Cha +10",
  "skills": "Deception +10, Nature +6, Perception +8, Stealth +10, Survival +8",
  "immunities": "poison",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 18",
  "languages": "Common, Sylvan",
  "abilities": {
    "str": 13,
    "dex": 20,
    "con": 18,
    "int": 12,
    "wis": 16,
    "cha": 20
  },
  "traits": [
    {
      "name": "Perfect Mimicry",
      "desc": "Baba Yaga can mimic animal and humanoid voices with an unerring quality. A creature that hears her mimicry can tell they are an imitation with a successful DC 20 Wisdom (Insight) check."
    },
    {
      "name": "Magic Resistance",
      "desc": "Baba Yaga has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "A Witch's Best Friend",
      "desc": "Baba Yaga's Hut acts as both a companion and her very own coven. In addition to defending its master and obeying her every command, the hut acts as Baba Yaga’s source of power. When within 60 feet of the hut, Baba Yaga gains her access to the Shared Spellcasting trait below. Should the hut reach 0 hit points, Baba Yaga's Shared Spellcasting is no longer available to her."
    },
    {
      "name": "Shared Spellcasting",
      "desc": "While Baba Yaga and her Hut are within 60 feet of one another, they can each cast the following spells but must share the spell slots among themselves. For casting these spells, Baba Yaga is an 18th-level spellcaster. Her spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). She knows the following spells, requiring no material components: * Cantrips (at will): <i>druid craft, minor illusion, resistance, shillelagh</i> * 1st level (4 slots): <i>entangle, speak with animals, ray of sickness</i> * 2nd level (3 slots): <i>flaming sphere, moonbeam, spike growth</i> * 3rd level (3 slots): <i>call lightning, dispel magic, plant growth</i> * 4th level (3 slots): <i>blight, hallucinatory terrain, stoneskin</i> * 5th level (3 slots): <i>antilife shell, gease, scrying</i> * 6th level (1 slot): <i>wall of thorns</i> * 7th level (1 slot): <i>finger of death</i> * 8th level (1 slot): <i>dominate monster</i> * 9th level (1 slot): <i>shapechange</i>"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "Baba Yaga makes two attacks with her claws."
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit 1d6+1 slashing damage and 4d8 acid damage."
    },
    {
      "name": "Witch's Brew (Recharge 5-6)",
      "desc": "Baba Yaga pulls a potion out of her mortar and pestle and throws it to a point within 60 feet of her. Each creature within a 30-foot radius of where the potion lands must make a DC 18 Constitution saving throw, taking 56 (16d6) poison damage, or half as much damage on a successful save."
    }
  ]
}