{
  "name": "Balban (Brute Demon)",
  "tags": [
    "large",
    "fiend",
    "cr9",
    "tome-of-horrors"
  ],
  "size": "Large",
  "type": "fiend",
  "alignment": "chaotic evil",
  "cr": "9 (5,000 XP)",
  "hp": "126 (11d10 + 66)",
  "ac": "17 (natural armor)",
  "speed": "40 ft.",
  "saves": "Con +10, Wis +6, Cha +6",
  "skills": "Intimidation +6, Perception +6",
  "immunities": "poison",
  "resistance": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "poisoned",
  "senses": "darkvision 120 ft., passive Perception 16",
  "languages": "Abyssal",
  "abilities": {
    "str": 25,
    "dex": 14,
    "con": 22,
    "int": 6,
    "wis": 14,
    "cha": 14
  },
  "traits": [
    {
      "name": "Magic Resistance",
      "desc": "The demon has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The demon’s weapon attacks are magical."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The demon’s spellcasting ability is Wisdom (spell save DC 14, +6 to hit with spell attacks). The demon can innately cast the following spells, requiring no material components: * At will: <i>fear, darkness, dispel magic, teleport, see invisibility</i>"
    },
    {
      "name": "Charge",
      "desc": "If the demon moves at least 20 feet straight toward a creature and then hits it with a bite attack on the same turn, that target must succeed on a DC 17 Strength saving throw or be knocked prone. If the target is prone, the demon can make one slam attack against it as a bonus action."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The demon can use its smash, make one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 16 (2d8 + 7) piercing damage."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (3d6 + 7) bludgeoning damage. If the target is a Medium or smaller creature, it is grappled (escape DC 17). Until this grapple ends, the target is restrained and the demon cannot use this attack against another target."
    },
    {
      "name": "Smash",
      "desc": "One Medium or smaller creature grappled by the demon is smashed into nearby solid objects or a solid surface. The target takes 25 (4d8 + 7) bludgeoning damage and must succeed on a DC 16 Constitution saving throw or be stunned until the end of its next turn."
    }
  ]
}