{
  "name": "Barrow Wight",
  "tags": [
    "medium",
    "undead",
    "cr3",
    "tome-of-horrors"
  ],
  "size": "Medium",
  "type": "undead",
  "alignment": "chaotic evil",
  "cr": "3 (700 XP)",
  "hp": "45 (6d8 + 18)",
  "ac": "14 (studded leather)",
  "speed": "30 ft.",
  "skills": "Perception +3, Stealth +4",
  "immunities": "poison",
  "resistance": "necrotic; bludgeoning, piercing and slashing from nonmagical weapons that are not silvered",
  "conimmunities": "exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "the languages it knew in life",
  "abilities": {
    "str": 16,
    "dex": 14,
    "con": 16,
    "int": 10,
    "wis": 13,
    "cha": 15
  },
  "traits": [
    {
      "name": "Gaze of Insanity",
      "desc": "If a creature starts its turn within 30 feet of the barrow wight and the two of them can see each other, the barrow wight can force the creature to make a DC 13 Wisdom saving throw if the barrow wight is not incapacitated. On a failed save, the creature is affected by a short-term madness effect for 1 minute. Roll percentile dice and determine the effect from the table below. * <i>1-20</i> The target retreats into its mind and becomes paralyzed. The effect ends if the creature takes any damage. * <i>21-30</i> The creature is incapacitated, and can only scream, laugh, or weep hysterically. * <i>31-40</i> The creature is frightened and must use its actions to flee from the source of the fear. * <i>41-50</i> The creature babbles incoherently and cannot speak normally or cast spells. * <i>51-60</i> The creature must use its action to attack the nearest creature. * <i>61-70</i> The creature hallucinates vividly, incurring disadvantage on all ability checks. * <i>71-75</i> The creature does whatever anyone tells it to do that isn’t obviously self-destructive. * <i>76-80</i> The creature experiences an overpowering urge to eat something strange, such as dirt, offal, or slime. * <i>81-90</i> The creature is stunned. * <i>91-100</i> The creature falls unconscious. The target can repeat the saving throw at the end of each of its turns. A successful save ends the effect and renders the target immune to the same barrow wight’s insanity gaze for 24 hours. A creature that isn’t surprised can avert its eyes to avoid the saving throw at the start of its turn. If the creature does so, it can’t see the barrow wight until the start of its next turn, when it can avert its eyes again. If the creature looks at the barrow wight in the meantime, it must immediately make the save."
    },
    {
      "name": "Sunlight Sensitivity",
      "desc": "While in sunlight, the wight has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    }
  ],
  "actions": [
    {
      "name": "Slam",
      "desc": "Melee weapon attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d6+3) bludgeoning damage plus 6 (1d6 + 3) necrotic damage. The target must succeed on a DC 13 Constitution saving throw or its hit point maximum is reduced by an amount equal to the necrotic damage taken. This reduction lasts until the target takes a long rest. The target dies if this effect reduces their hit point maximum to zero. A humanoid slain by this attack rises 1d4 rounds later as a barrow wight under the control of the wight that killed it unless the humanoid is restored to life or its body is destroyed. The wight can have no more than three barrow wights under its control at one time."
    }
  ]
}