{
  "name": "Bastet Temple Cat",
  "tags": [
    "small",
    "monstrosity",
    "cr1",
    "tome-of-beasts"
  ],
  "size": "Small",
  "type": "monstrosity",
  "alignment": "chaotic neutral",
  "cr": "1 (200 XP)",
  "hp": "40 (9d6 + 9)",
  "ac": "14",
  "speed": "40 ft., climb 30 ft.",
  "skills": "Perception +5, Stealth +6",
  "senses": "darkvision 60 ft., passive Perception 15",
  "languages": "Common, Nurian, and Sylvan",
  "abilities": {
    "str": 8,
    "dex": 19,
    "con": 12,
    "int": 12,
    "wis": 16,
    "cha": 18
  },
  "traits": [
    {
      "name": "Keen Smell",
      "desc": "The temple cat has advantage on Wisdom (Perception) checks that rely on smell."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The temple cat's innate spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). The temple cat can innately cast the following spells, requiring no material components: * At will: <i>guidance</i> * 3/day each: <i>charm person, cure wounds</i> * 1/day: <i>enhance ability</i> (only Cat's Grace)"
    },
    {
      "name": "Priestly Purr",
      "desc": "When a cleric or paladin who worships Bastet spends an hour preparing spells while a Bastet temple cat is within 5 feet, that spellcaster can choose two 1st-level spells and one 2nd-level spell that they are able to cast and imbue them into the temple cat. The temple cat can cast these spells 1/day each without a verbal component. These spells are cast as if they were included in the temple cat's Innate Spellcasting trait."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The temple cat makes one bite attack and one claws attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 6 (1d4 + 4) piercing damage."
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 9 (2d4 + 4) slashing damage."
    },
    {
      "name": "Fascinating Lure",
      "desc": "The temple cat purrs loudly, targeting a humanoid it can see within 30 feet that can hear the temple cat. The target must succeed on a DC 14 Wisdom saving throw or be charmed. While charmed by the temple cat, the target must move toward the cat at normal speed and try to pet it or pick it up. A charmed target repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful, the creature is immune to the temple cat's Fascinating Lure for the next 24 hours. The temple cat has advantage on attack rolls against any creature petting or holding it."
    }
  ]
}