{
  "name": "Behir Zombie",
  "tags": [
    "huge",
    "undead",
    "cr11",
    "tome-of-horrors"
  ],
  "size": "Huge",
  "type": "undead",
  "alignment": "neutral evil",
  "cr": "11 (7,200 XP)",
  "hp": "168 (16d12 + 64)",
  "ac": "17 (natural armor)",
  "speed": "50 ft., climb 40 ft.",
  "saves": "Wis +2",
  "immunities": "lightning, poison",
  "conimmunities": "exhaustion, poisoned",
  "senses": "darkvision 90 ft., passive Perception 8",
  "languages": "--",
  "abilities": {
    "str": 23,
    "dex": 10,
    "con": 18,
    "int": 3,
    "wis": 7,
    "cha": 5
  },
  "traits": [
    {
      "name": "Undead Fortitude",
      "desc": "If damage reduces the zombie to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the zombie drops to 1 hit point instead."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The zombie makes two attacks: one with its bite and one with its constrict."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) piercing damage."
    },
    {
      "name": "Constrict",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one Large or smaller creature. Hit: 17 (2d10 + 6) bludgeoning damage plus 17 (2d10 + 6) slashing damage. The target is grappled (escape DC 16) if the zombie isn’t already constricting a creature, and the target is restrained until this grapple ends."
    },
    {
      "name": "Swallow",
      "desc": "The zombie makes one bite attack against a Medium or smaller target it is grappling. If the attack hits, the target is also swallowed, and the grapple ends. While swallowed, the target is blinded and restrained, it has total cover against attacks and other effects outside the zombie, and it takes 21 (6d6) necrotic damage at the start of each of the zombie’s turns. A behir zombie can have only one creature swallowed at a time. If the zombie dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 15 ft. of movement, exiting prone."
    }
  ]
}