{
  "name": "Black Orc High Priest of Orcus",
  "tags": [
    "medium",
    "humanoid",
    "cr9",
    "tome-of-horrors"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "chaotic evil",
  "cr": "9 (5,000 XP)",
  "hp": "127 (15d8 + 60)",
  "ac": "16 (scale mail)",
  "speed": "30 ft.",
  "saves": "Wis +9, Cha +6",
  "skills": "Arcana +5, Deception +6, Insight +9, Intimidation +6, Perception +9",
  "senses": "truesight 120 ft., passive Perception 19",
  "languages": "Abyssal, Common, Orc",
  "abilities": {
    "str": 16,
    "dex": 14,
    "con": 18,
    "int": 12,
    "wis": 20,
    "cha": 14
  },
  "traits": [
    {
      "name": "Abyssal Blessing",
      "desc": "The priest of Orcus gains 10 temporary hit points when it reduces a hostile creature that is not an undead to 0 hit points."
    },
    {
      "name": "Blessing of Orcus",
      "desc": "Black orcs have advantage on saving throws against the spells and effects of undead creatures."
    },
    {
      "name": "Deadsight",
      "desc": "The high priest of Orcus has truesight out to a range of 120 feet."
    },
    {
      "name": "Spellcasting",
      "desc": "The high priest of Orcus is a 10 level spellcaster. Its spellcasting ability is Wisdom (spell save DC 17, +9 to hit with spell attacks). It has the following cleric spells prepared: * Cantrips (at will): <i>chill touch, guidance, mending, resistance</i> * 1st level (4 slots): <i>bane, cure wounds, false life, inflict wounds</i> * 2nd level (3 slots): <i>aid, blindness/deafness, hold person, silence</i> * 3rd level (3 slots): <i>animate dead, bestow curse, dispel magic, spirit guardians</i> * 4th level (3 slots): <i>banishment, death ward, guardian of faith</i> * 5th level (2 slots): <i>dispel evil and good, insect plague</i>"
    },
    {
      "name": "Unholy Strike",
      "desc": "Once on each of the high priest’s turns when it hits a creature with a melee weapon attack, the high priest can cause the attack to deal an extra 18 (4d8) necrotic damage to the target."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The high priest makes two melee attacks."
    },
    {
      "name": "Mace",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) bludgeoning damage."
    },
    {
      "name": "Caress of Orcus (Recharge 5–6)",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) necrotic damage, and the target’s Strength score is reduced by 1d4. The target dies if this reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a short or long rest. If a non-evil humanoid dies from this attack, a shadow rises from the corpse in 24 hours under the priest’s control, unless the humanoid is restored to life or its body is destroyed. The priest can have no more than three shadows under its control at one time."
    }
  ]
}