{
  "name": "Bouda",
  "tags": [
    "medium",
    "fiend",
    "cr5",
    "tome-of-beasts"
  ],
  "size": "Medium",
  "type": "fiend",
  "alignment": "neutral evil",
  "cr": "5 (1800 XP)",
  "hp": "93 (11d8 + 44)",
  "ac": "15 (natural armor)",
  "speed": "30 ft.",
  "saves": "Dex+5, Con +7, Wis +4, Cha +5",
  "skills": "Athletics +7, Deception +5, Intimidation +5, Perception +4, Stealth +5",
  "immunities": "fire, poison",
  "resistance": "acid, lightning; bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered",
  "conimmunities": "charmed, exhaustion, poisoned",
  "senses": "darkvision 120 ft., passive Perception 14",
  "languages": "Common, Celestial, Infernal, Nurian; telepathy 100 ft.",
  "abilities": {
    "str": 19,
    "dex": 14,
    "con": 18,
    "int": 10,
    "wis": 12,
    "cha": 15
  },
  "traits": [
    {
      "name": "Shapechanger",
      "desc": "The bouda can use its action to polymorph into a human, a hyena, or its true form, which is a hyena-humanoid hybrid. Its statistics, other than its Mephitic Claw attack, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if destroyed, before turning to dust."
    },
    {
      "name": "Defiling Smear (1/Day)",
      "desc": "The bouda can secrete a disgusting whitish-yellow substance with the viscosity of tar to mark food and territory. As a bonus action, the bouda marks a single adjacent 5-foot space, object, or helpless creature. Any living creature within 30 feet of the smear at the start of its turn must succeed on a DC 15 Constitution saving throw against poison or be poisoned for 1d6 rounds. A creature that makes a successful saving throw is immune to that particular bouda's defiling smear for 24 hours. The stench of a smear remains potent for one week."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The bouda's innate spellcasting ability is Charisma (spell save DC 13, +5 to hit with spell attacks). It can cast the following spells, requiring no material components: Constant: detect evil and good, detect magic At will: thaumaturgy 3/day: darkness, expeditious retreat 1/day: contagion"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The bouda makes one bite attack and one mephitic claw attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage plus 10 (3d6) poison damage."
    },
    {
      "name": "Mephitic Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage, and the target must make a successful DC 15 Constitution saving throw or become poisoned for 1 round by the visible cloud of vermin swarming around the bouda's forearms."
    },
    {
      "name": "Ravenous Gorge",
      "desc": "The bouda consumes the organs of a corpse in a space it occupies. It gains temporary hit points equal to the dead creature's HD that last 1 hour. Organs consumed by this ability are gone, and the creature can't be restored to life through spells and magical effects that require a mostly intact corpse."
    }
  ]
}