{
  "name": "Buraq",
  "tags": [
    "medium",
    "celestial",
    "cr11",
    "tome-of-beasts"
  ],
  "size": "Medium",
  "type": "celestial",
  "alignment": "lawful good",
  "cr": "11 (7200 XP)",
  "hp": "152 (16d8 + 80)",
  "ac": "17",
  "speed": "60 ft., fly 90 ft.",
  "saves": "Con +9, Wis +8, Cha +9",
  "skills": "History +8, Religion +8",
  "resistance": "radiant; bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "charmed, exhaustion, frightened",
  "senses": "truesight 120 ft., passive Perception 14",
  "languages": "Celestial, Common, Primordial, telepathy 120 ft.",
  "abilities": {
    "str": 15,
    "dex": 18,
    "con": 20,
    "int": 18,
    "wis": 18,
    "cha": 20
  },
  "traits": [
    {
      "name": "Angelic Weapons",
      "desc": "The buraq's attacks are magical. When the buraq hits with its hooves, it deals an extra 4d8 radiant damage (included in the attack)."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The buraq's innate spellcasting ability is Charisma (spell save DC 17). The buraq can innately cast the following spells, requiring no components: At will: comprehend languages, detect evil and good, holy aura, pass without trace 3/day each: haste, longstrider 1/day each: plane shift, wind walk"
    },
    {
      "name": "Magic Resistance",
      "desc": "The buraq has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Night Journey",
      "desc": "When outdoors at night, a buraq's vision is not limited by nonmagical darkness. Once per month, the buraq can declare it is on a night journey; for the next 24 hours, it can use its Teleport once per round. Its destination must always be in an area of nonmagical darkness within its line of sight. At any point during the night journey, as a bonus action, the buraq can return itself and its rider to the location where it began the night journey."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The buraq makes two attacks with its hooves."
    },
    {
      "name": "Hooves",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage plus 18 (4d8) radiant damage."
    },
    {
      "name": "Teleport (1/Day)",
      "desc": "The buraq magically teleports itself and its rider, along with any equipment it is wearing or carrying, to a location the buraq is familiar with, up to 1 mile away."
    }
  ]
}