{
  "name": "Cambium",
  "tags": [
    "large",
    "fiend",
    "cr14",
    "tome-of-beasts"
  ],
  "size": "Large",
  "type": "fiend",
  "alignment": "neutral evil",
  "cr": "14 (11500 XP)",
  "hp": "264 (23d10 + 138)",
  "ac": "19 (natural armor)",
  "speed": "40 ft.",
  "saves": "Dex +8, Con +11, Int +8, Wis +8, Cha +9",
  "skills": "Arcana +8, Deception +9, Insight +8, Medicine +8, Perception +8, Stealth +8",
  "immunities": "poison",
  "conimmunities": "exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 18",
  "languages": "Common, Draconic, Infernal",
  "abilities": {
    "str": 21,
    "dex": 16,
    "con": 23,
    "int": 17,
    "wis": 16,
    "cha": 18
  },
  "traits": [
    {
      "name": "Innate Spellcasting",
      "desc": "The cambium's innate spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). The cambium can innately cast the following spells, requiring no material components: Constant: levitate At will: alter self, detect thoughts, hold person, plane shift, spare the dying 3/day: cure wounds 21 (4d8 + 3), ray of sickness 18 (4d8), protection from poison, heal 1/day: finger of death"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The cambium makes four needle fingers attacks."
    },
    {
      "name": "Needle Fingers",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 21 (3d10 + 5) piercing damage. In addition, the target must make a DC 19 Constitution saving throw; if it fails, the cambium can either inflict Ability Damage or Imbalance Humors. A target makes this saving throw just once per turn, even if struck by more than one needle fingers attack."
    },
    {
      "name": "Ability Damage (3/Day)",
      "desc": "When the target of the cambium's needle fingers fails its Constitution saving throw, one of its ability scores (cambium's choice) is reduced by 1d4 until it finishes a long rest. If this reduces a score to 0, the creature is unconscious until it regains at least one point."
    },
    {
      "name": "Imbalance Humors (3/Day)",
      "desc": "When the target of the cambium's needle fingers fails its Constitution saving throw, apply one of the following effects:"
    },
    {
      "name": "Sanguine Flux: The target cannot be healed",
      "desc": "aturally or magically.until after their next long rest."
    },
    {
      "name": "Choleric Flux: The target becomes confused (as the spell) for 3d6 rounds",
      "desc": "The target can repeat the saving throw at the end of each of its turns to shrug off the flux before the duration ends."
    },
    {
      "name": "Melancholic Flux: The target is incapacitated for 1d4 rounds and slowed (as the spell) for 3d6 rounds",
      "desc": "The target can repeat the saving throw at the end of each of its turns to shrug off the flux before the duration ends."
    },
    {
      "name": "Phlegmatic Flux: A successful DC 18 Constitution saving throw negates this effect",
      "desc": "A failed saving throw means the target gains one level of exhaustion which lasts for 3d6 rounds."
    }
  ]
}