{
  "name": "Cerebug",
  "tags": [
    "tiny",
    "aberration",
    "cr2",
    "out-of-the-box-5e"
  ],
  "size": "Tiny",
  "type": "aberration",
  "alignment": "lawful evil",
  "cr": "2 (700 XP)",
  "hp": "21 (6d4 + 6)",
  "ac": "14 (natural armor)",
  "speed": "20 ft., burrow 40 ft., climb 20 ft.",
  "skills": "Perception +2, Stealth +4",
  "conimmunities": "Blinded",
  "senses": "Blindsight 30 ft., Tremorsense 30 ft., Passive Perception 12",
  "languages": "understands Common, Telepathy 60 ft.",
  "abilities": {
    "str": 8,
    "dex": 14,
    "con": 13,
    "int": 12,
    "wis": 10,
    "cha": 6
  },
  "traits": [
    {
      "name": "Hunger for the Warm Blooded",
      "desc": "A cerebug can smell the presence of warm blooded creatures even when buried below the surface to a range of 30 ft. even if those scents are covered by perfumes, rot or other strong odors."
    },
    {
      "name": "Spider Climb",
      "desc": "A cerebug can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The cerebug makes one attack with its burrowing claws and one with its sonic drill."
    },
    {
      "name": "Burrowing Claws",
      "desc": "Melee Weapon Attack: +2 to hit, reach 5 ft., one target, Hit: 5 (2d4) slashing damage."
    },
    {
      "name": "Parasitic Domination",
      "desc": "The cerebug targets a stunned creature within 5 ft. and attempts to burrow into its skull cavity. The cerebug makes an attack with its burrowing claws, and any successful attack is a critical hit. If this damage reduces the target to 0 hit points, the cerebug burrows into the skull and eats the brain, killing the creature. It then occupies the skull cavity and takes control of the host body. The host body begins to rot within 24 hours, and the cerebug attempts to use the host body to lure new victims and consume more brains. If the cerebug leaves the host body, the dead creature can be restored to life with a resurrection spell or similar magic to restore the missing brain."
    },
    {
      "name": "Sonic Drill",
      "desc": "The cerebug targets one creature it can sense within 10 ft. It emits a focused droning beam of sonic energy intended to stun the target. The target must succeed on a DC 12 Intelligence saving throw or take 11 (2d10) thunder damage and be stunned until the end of the cerebug’s next turn."
    }
  ]
}