{
  "name": "Corlapis Architect",
  "tags": [
    "medium",
    "elemental",
    "cr4",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "elemental",
  "alignment": "lawful neutral",
  "cr": "4 (1,100 XP)",
  "hp": "75 (10d8 + 30)",
  "ac": "16 (natural armor)",
  "speed": "30 ft.",
  "saves": "Con +5",
  "skills": "Stealth +2",
  "immunities": "poison",
  "conimmunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Terran",
  "abilities": {
    "str": 19,
    "dex": 10,
    "con": 17,
    "int": 16,
    "wis": 10,
    "cha": 10
  },
  "traits": [
    {
      "name": "Hardened Exterior",
      "desc": "Bludgeoning, piercing, and slashing damage the corlapis takes from nonmagical weapons is reduced by 3 to a minimum of 1."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The corlapis's innate spellcasting ability is Intelligence (spell save DC 13). It can innately cast the following spells, requiring no material components: * At will: <i>light, shape stone, stoneskin </i>(self only)"
    },
    {
      "name": "Stone Camouflage",
      "desc": "The corlapis has advantage on Dexterity (Stealth) checks to hide in rocky terrain."
    },
    {
      "name": "Sturdy",
      "desc": "The corlapis has advantage on saving throws against effects that would cause it to move or be knocked prone."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The corlapis makes two attacks with its warhammer."
    },
    {
      "name": "Warhammer",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage, or 9 (1d10 + 4) bludgeoning damage if used with two hands."
    },
    {
      "name": "Hurl Boulder",
      "desc": "Ranged Weapon Attack: +6 to hit, range 30/90 ft., one target. Hit: 15 (2d10 + 4) bludgeoning damage."
    },
    {
      "name": "Stonework Prison (1/Day)",
      "desc": "The corlapis summons a 10-foot diameter cage of stone at a point it can see within 90 feet. Each side of the cage has 15 hit points and AC 15. Any creature in the cage's area must make a DC 13 Dexterity saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space outside of it. A Huge or larger creature succeeds on the saving throw automatically. On a failed save, a creature is trapped within the bars of the cage. The bars are wide enough to allow projectiles to pass through it, but not melee weapons. The cage can hold a maximum of four Medium or smaller creatures or one Large creature."
    }
  ]
}