{
  "name": "Death Butterfly Swarm",
  "tags": [
    "large",
    "swarm",
    "cr4",
    "tome-of-beasts"
  ],
  "size": "Large",
  "type": "swarm",
  "alignment": "chaotic evil",
  "cr": "4 (1100 XP)",
  "hp": "60 (11d10)",
  "ac": "15 (natural armor)",
  "speed": "5 ft., fly 40 ft. (hover)",
  "resistance": "bludgeoning, piercing, slashing",
  "vulnerability": "cold, fire",
  "conimmunities": "charmed, frightened, paralyzed, petrified, prone, restrained, petrified",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "--",
  "abilities": {
    "str": 1,
    "dex": 13,
    "con": 10,
    "int": 1,
    "wis": 12,
    "cha": 15
  },
  "traits": [
    {
      "name": "Potent Poison",
      "desc": "The death butterfly swarm's poison affects corporeal undead who are otherwise immune to poison."
    },
    {
      "name": "Swarm",
      "desc": "The swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny insect. The swarm can't regain hit points or gain temporary hit point."
    },
    {
      "name": "Weight of Wings",
      "desc": "A creature in a space occupied by the death butterfly swarm has its speed reduced by half, and must succeed on a DC 13 Dexterity saving throw or become blinded. Both effects end when the creature doesn't share a space with the swarm at the end of the creature's turn. If a creature succeeds on the saving throw, it is immune to the swarm's blindness (but not the speed reduction) for 24 hours."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The swarm makes a Bite attack against every target in its spaces."
    },
    {
      "name": "Bites",
      "desc": "Melee Weapon Attack: +3 to hit, reach 0 ft., every target in the swarm's space. Hit: 22 (6d6 +1) piercing damage, or 11 (3d6 + 1) piercing damage if the swarm has half of its hit points or fewer. The target also takes 10 (3d6) poison damage and becomes poisoned for 1d4 rounds; a successful DC 13 Constitution saving throw reduces poison damage by half and prevents the poisoned condition.."
    }
  ]
}