{
  "name": "Demonic Knight",
  "tags": [
    "medium",
    "fiend",
    "cr6",
    "tome-of-horrors"
  ],
  "size": "Medium",
  "type": "fiend",
  "alignment": "chaotic evil",
  "cr": "6 (2,300 XP)",
  "hp": "85 (10d8 + 40)",
  "ac": "17 (half plate)",
  "speed": "30 ft.",
  "skills": "Arcana +6, Athletics +8, Perception +7, Stealth +4",
  "resistance": "acid, cold, fire; bludgeoning, piercing, and slashing damage from nonmagical weapons",
  "conimmunities": "charmed, frightened",
  "senses": "truesight 60 ft., passive Perception 17",
  "languages": "Abyssal, Common",
  "abilities": {
    "str": 20,
    "dex": 13,
    "con": 18,
    "int": 17,
    "wis": 18,
    "cha": 18
  },
  "traits": [
    {
      "name": "Innate Spellcasting",
      "desc": "The demonic knight’s innate spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can cast the following spells without requiring material components: * At will: <i>detect magic, wall of ice</i> * 2/day: <i>dispel magic</i> * 1/day each: <i>bestow curse, fireball</i>"
    },
    {
      "name": "Magic Weapon",
      "desc": "The demonic knight’s weapon attacks are considered magical for the purposes of damage resistance."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The demonic knight makes two longsword attacks, or one one-handed longsword attack and one mailed fist attack."
    },
    {
      "name": "Longsword",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) slashing damage, or 10 (1d10 + 5) slashing damage if used with two hands."
    },
    {
      "name": "Mailed Fist",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) bludgeoning damage."
    },
    {
      "name": "Breath of Unlife (Recharge 5–6)",
      "desc": "The demonic knight releases a 10- foot cone of necrotic breath. Creatures in the area must make a DC 15 Constitution saving throw. On a failed save, a creature takes 28 (8d6) necrotic damage. If a humanoid creature is slain by this damage, it rises as a shadow demon under the command of the demonic knight that created it. The new shadow demon remains enslaved to the demonic knight until the knight’s death and cannot summon demons of its own. A demonic knight can only have two such shadow demons under its command."
    },
    {
      "name": "Summon Demon (1/day)",
      "desc": "A demonic knight has a 50 percent chance of summoning 1d4 shadow demons, 2 hezrous, 1 glabrezu, 1 vrock, or 1 marilith. The summoned demon appears in an unoccupied space within 60 feet. It cannot summon further demons and remains only for 1 minute before vanishing. It disappears early if it or the demonic knight is slain."
    }
  ]
}