{
  "name": "Dragon Crab",
  "tags": [
    "gargantuan",
    "monstrosity",
    "cr16",
    "tome-of-horrors"
  ],
  "size": "Gargantuan",
  "type": "monstrosity",
  "alignment": "neutral evil",
  "cr": "16 (15,000 XP)",
  "hp": "210 (12d20 + 84)",
  "ac": "18 (natural armor)",
  "speed": "40 ft., swim 50 ft.",
  "saves": "Con +12, Wis +8, Cha +5",
  "skills": "Deception +5, Nature +8, Perception +8, Stealth +6, Survival +8",
  "immunities": "piercing and slashing from nonmagical weapons",
  "resistance": "bludgeoning from nonmagical weapons",
  "senses": "darkvision 120 ft., passive Perception 18",
  "languages": "Common and any four others",
  "abilities": {
    "str": 21,
    "dex": 13,
    "con": 25,
    "int": 17,
    "wis": 16,
    "cha": 11
  },
  "traits": [
    {
      "name": "Legendary Resistance (3/day)",
      "desc": "If the dragon crab fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Magic Resistance",
      "desc": "The dragon crab has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Spellcasting",
      "desc": "The dragon crab is a 12th level spellcaster. Its casting ability is Wisdom (spell save DC 16, +8 to hit with spell attacks). The dragon crab can cast the following spells: * Cantrips (at will): <i>druidcraft, guidance, poison spray, resistance</i> * 1st level (4 slots): <i>detect magic, entangle, speak with animals, thunderwave</i> * 2nd level (3 slots): <i>heat metal, hold person, spike growth</i> * 3rd level (3 slots): <i>cure wounds, dispel magic, protection from energy</i> * 4th level (3 slots): <i>blight, confusion, hallucinatory terrain</i> * 5th level (2 slots): <i>conjure elemental, contagion</i> * 6th level (1 slot): <i>wall of thorns</i>"
    },
    {
      "name": "Subservient Seas",
      "desc": "The dragon crab can influence the behavior of aquatic creatures within 6 miles of the lair that have an intelligence score of 3 or lower, charming them, usually to lure them into the lair as food although they can be directed to swarm and attack creatures. If the dragon crab unbalances the local ecosystem through use of this power, the ability ceases to function for 1d20 months, until balance is restored. Most dragon crabs use this ability very sparingly."
    },
    {
      "name": "Eldritch Tides",
      "desc": "Surface waters in a 4-mile radius above the dragon crab’s lairs are prone to strange currents, unpredictable winds, and even some whirlpools. The dragon crab has no control over these and they cannot be used to its direct tactical advantage, but they increase the difficulty of seagoing navigation by 5 for any vessels or swimming creatures that attempt to traverse them. Local sea life has adapted to these strange currents; anything born within the 4-mile radius of the effect suffers no penalties in navigating it."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon crab makes six attacks: two with its pincers and four with its legs. It can use Crush instead of a pincer attack."
    },
    {
      "name": "Pincer",
      "desc": "Melee Weapon Attack: +10 to hit, reach 15 ft., one target. Hit: 16 (2d10 + 5) bludgeoning damage. If the target is a Large or smaller creature, it is grappled (escape DC 15). The dragon crab has two pincers, each of which can grapple only one target."
    },
    {
      "name": "Kick",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) piercing damage."
    },
    {
      "name": "Crush",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target grappled by the dragon crab. Hit: 16 (2d10 + 5) bludgeoning damage."
    },
    {
      "name": "Riptide",
      "desc": "Pools of water within 120 feet of the dragon crab that it can see surge outward in a grasping tide. Any creature on the ground within 20 feet of such a pool must succeed on a DC 15 Strength saving throw or be pulled up to 20 feet into the water and knocked prone."
    },
    {
      "name": "Pooling Shadow",
      "desc": "Magical darkness spreads from a chosen point within 60 feet of the dragon crab, filling a 15-foot radius sphere until the dragon crab dismisses it as an action, uses this lair action again, or dies. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it. If any of the effect’s area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled."
    },
    {
      "name": "Treacherous Hoards",
      "desc": "A heap of the dragon crab’s treasure hoard collapses over one target within 120 feet that the dragon crab can see. The creature must succeed on a DC 15 Dexterity saving throw or take 10 (3d6) bludgeoning damage and be knocked prone and buried. The buried target is restrained and unable to breathe or stand up. The creature can take an action to make a DC 15 Strength check, ending the buried state on a success."
    }
  ],
  "legendary": [
    {
      "name": "Detect",
      "desc": "The dragon crab makes a Wisdom (Perception) check."
    },
    {
      "name": "Gleam",
      "desc": "The dragon crab reflects light into the eyes of one target it can see within 60 feet. The target must succeed on a DC 18 Dexterity saving throw or be blinded until the end of the dragon crab’s next turn."
    },
    {
      "name": "Pincer (Costs 2 Actions)",
      "desc": "The dragon crab performs two pincer attacks or uses Crush on up to two creatures it already has grappled. Cast a Spell (Costs 3 Actions). The dragon crab casts a spell from its list of prepared spells, using a spell slot as normal."
    }
  ]
}