{
  "name": "Elemental Shaper",
  "tags": [
    "medium",
    "humanoid",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any alignment",
  "cr": "5 (1,800 XP)",
  "hp": "74 (8d8 + 4d6 + 24)",
  "ac": "16",
  "speed": "45 ft.",
  "saves": "Str +4, Dex +8",
  "skills": "Acrobatics +8, Arcana +4, Insight +6, Persuasion +7",
  "senses": "passive Perception 12",
  "languages": "Any three languages",
  "abilities": {
    "str": 10,
    "dex": 18,
    "con": 14,
    "int": 10,
    "wis": 14,
    "cha": 17
  },
  "traits": [
    {
      "name": "Elemental Strikes (6/Short Rest)",
      "desc": "Whenever the shaper performs an unarmed strike, it can imbue the attack with elemental magics, granting additional properties depending on the element chosen: * Fire – The strike deals an additional 3 (1d6) fire damage and has its range increased by 10 feet as a whip of flame extends from the shaper's hands. * Ice – The strike inflicts chill into the heart of the target, reducing its move speed by 10 feet and preventing it from taking the disengage action until the end of your next turn. * Lightning – The strike surges lightning through the target's body. If that creature attempts to cast a spell requiring somatic components on its next turn, it must succeed on a DC 15 Constitution saving throw or be unable to perform the required motions, causing the spell to fail."
    },
    {
      "name": "Spellcasting",
      "desc": "The shaper is a 3th-level spellcaster. Its spellcasting ability is charisma (spell save DC 15, +7 to hit with spell attacks). The shaper has the following sorcerer spells prepared: * Cantrips (at will): <i>firebolt, ray of frost, shocking grasp</i> * 1st level (4 slots): <i>chromatic orb, burning hands, witch bolt</i> * 2nd level (2 slots): <i>enhance ability, scorching ray</i>"
    },
    {
      "name": "Unarmored Defense",
      "desc": "While not wearing armor, the traveler's AC includes its Wisdom modifier."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The shaper makes three unarmed strikes."
    },
    {
      "name": "Unarmed Strike",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage."
    }
  ]
}