{
  "name": "Feyblade Paladin",
  "tags": [
    "medium",
    "humanoid",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any alignment",
  "cr": "5 (1,800 XP)",
  "hp": "86 (8d10 + 4d8 + 24)",
  "ac": "20 (plate, shield)",
  "speed": "30 ft.",
  "saves": "Wis +4, Cha +8",
  "skills": "Arcana +6, Nature +6, Performance +8, Persuasion +8",
  "senses": "passive Perception 10",
  "languages": "Any three languages",
  "abilities": {
    "str": 16,
    "dex": 8,
    "con": 14,
    "int": 15,
    "wis": 10,
    "cha": 18
  },
  "traits": [
    {
      "name": "Combat Caster",
      "desc": "The paladin can perform the somatic components of spells even when it has weapons or a shield in one or both hands."
    },
    {
      "name": "Divine Smite",
      "desc": "When the paladin hits with a melee weapon attack, it can expend a spell slot to deal an addition 9 (2d8) radiant damage, in addition to the weapon's damage. This damage increases by 1d8 radiant damage per spell slot level above 1st."
    },
    {
      "name": "Dueling Fighting Style",
      "desc": "The slayer gains a +2 bonus to damage rolls while wielding a melee weapon in one hand and no other weapons (included in the attack)."
    },
    {
      "name": "Fey-Infused Weapon",
      "desc": "The paladin's weapon is infused with energies of fey. Whenever an enemy is struck by its blade, it must succeed on a DC 16 Wisdom saving throw or be affected by the <i>faerie fire</i> spell for one minute or until the paladin strikes another target with its weapon."
    },
    {
      "name": "Pact Magic",
      "desc": "The paladin is a 9th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 16, +8 to hit with spell attacks). It regains these expended spellslots when it finishes a short or long rest. The paladin has the following warlock spells prepared: * Cantrips (at will): <i>blade ward, eldritch blast, true strike</i> * 1st-2nd level (2 2nd-level slots): <i>calm emotions, darkness, faerie fire, phantasmal force, sleep</i>"
    },
    {
      "name": "Spellcasting",
      "desc": "The paladin is a 9th-level spellcaster. Its spellcasting ability is charisma (spell save DC 16, +8 to hit with spell attacks). The paladin has the following paladin spells prepared: * 1st level (4 slots): <i>bless, detect good and evil, ensnaring strike, speak with animals</i> * 2nd level (2 slots): <i>find steed, lesser restoration, magic weapon, moonbeam, misty step</i>"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The paladin makes two attacks with its longsword."
    },
    {
      "name": "Longsword",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) slashing damage, or 9 (1d10 + 4) slashing damage if used with two hands."
    }
  ]
}