{
  "name": "Flameblade Crusader",
  "tags": [
    "medium",
    "humanoid",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any alignment",
  "cr": "5 (1,800 XP)",
  "hp": "62 (8d6 + 4d10 + 12)",
  "ac": "17 (splint mail)",
  "speed": "30 ft.",
  "saves": "Int +8, Wis +5",
  "skills": "Arcana +8, Athletics +7, Deception +6, Religion +8",
  "senses": "passive Perception 11",
  "languages": "Any four languages",
  "abilities": {
    "str": 17,
    "dex": 10,
    "con": 12,
    "int": 19,
    "wis": 12,
    "cha": 14
  },
  "traits": [
    {
      "name": "Arcane Recovery (1/Day)",
      "desc": "When the crusader finishes a short rest, it can regain up to 4 total expended spell slots."
    },
    {
      "name": "Burning Strike",
      "desc": "When the crusader hits with a melee weapon attack, it can expend a spell slot to deal an addition 9 (2d8) fire damage, in addition to the weapon's damage. This damage increases by 1d8 fire damage per spell slot level above 1st."
    },
    {
      "name": "Combat Caster",
      "desc": "The crusader can perform the somatic components of spells even when it has weapons or a shield in one or both hands."
    },
    {
      "name": "Endless Assault",
      "desc": "When the crusader takes the attack action, it can expend a spell slot up to level 2 to gain additional attacks this turn. If a level 1 slot is expended, the crusader gains one additional attack. If the level 2 spell slot is expended, the crusader gains 2 additional attacks."
    },
    {
      "name": "Transmutation Mastery",
      "desc": "The crusader has a deep knowledge of transmutation magics and can use that to adapt its fighting style to the needs at hand. As a bonus action, the crusader can transform its weapon into a pike, a greatsword, or back to a maul."
    },
    {
      "name": "Spellcasting",
      "desc": "The crusader is a 9th-level spellcaster. Its spellcasting ability is intelligence (spell save DC 16, +8 to hit with spell attacks). The crusader has the following wizard and paladin spells prepared: * Cantrips (at will): <i>dancing lights, fire bolt</i> * 1st level (4 slots): <i>burning hands, searing smite, thunderous smite</i> * 2nd level (3 slots): <i>flaming sphere, magic weapon</i> * 3rd level (3 slots): <i>fireball, phantom steed</i> * 4th level (2 slots): <i>fire shield, wall of fire</i>"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The crusader makes two melee attacks."
    },
    {
      "name": "Maul",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage."
    },
    {
      "name": "Pike",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 8 (1d10 + 3) piercing damage."
    },
    {
      "name": "Greatsword",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage."
    }
  ]
}