{
  "name": "Furious Zealot",
  "tags": [
    "medium",
    "humanoid",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any alignment",
  "cr": "5 (1,800 XP)",
  "hp": "81 (7d8 + 3d12 + 30)",
  "ac": "15 (unarmored defense, shield)",
  "speed": "30 ft.",
  "saves": "Wis +7, Cha +6",
  "skills": "Athletics +8, Insight +7, Persuasion +6, Religion +4",
  "senses": "passive Perception 13",
  "languages": "Any two languages",
  "abilities": {
    "str": 18,
    "dex": 10,
    "con": 16,
    "int": 10,
    "wis": 16,
    "cha": 14
  },
  "traits": [
    {
      "name": "Combat Caster",
      "desc": "The zealot can perform the somatic components of spells even when it has weapons or a shield in one or both hands."
    },
    {
      "name": "Danger Sense",
      "desc": "The zealot has advantage on Dexterity saving throws."
    },
    {
      "name": "Rage (2/Day)",
      "desc": "As a bonus action, the zealot can enter a rage for 1 minute. While raging, the zealot gains the following benefits: * Advantage on Strength checks and Strength saving throws * Melee weapon attacks deal an addition 2 damage. * The zealot gains resistance to bludgeoning, piercing, and slashing damage."
    },
    {
      "name": "Spellcasting",
      "desc": "The zealot is a 6th-level spellcaster. Its spellcasting ability is wisdom (spell save DC 15, +7 to hit with spell attacks). The zealot has the following cleric spells prepared: Cantrips (at will): guidance, sacred flame * 1st level (4 slots): <i>fog cloud, thunderwave</i> * 2nd level (3 slots): <i>gust of wind, shatter</i> * 3rd level (3 slots): <i>call lightning, sleet storm</i>"
    },
    {
      "name": "Thunderbolt Strike",
      "desc": "When the zealot deals damage to a Large or smaller creature, it can also push it up to 10 feet away from it."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The zealot makes three attacks with its warhammer."
    },
    {
      "name": "Warhammer",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage, or 10 (1d8 + 6) bludgeoning damage while raging."
    },
    {
      "name": "Storm's Wrath (3/Day)",
      "desc": "When a creature within 5 feet of the zealot hits it with an attack, it can use its reaction to cause that creature to make a DC 15 Dexterity saving throw. The creature takes 9 (2d8) lightning damage on a failed saving throw, or half as much damage on a successful one."
    }
  ]
}