{
  "name": "Gem Dog",
  "tags": [
    "small",
    "monstrosity",
    "cr9",
    "tome-of-horrors"
  ],
  "size": "Small",
  "type": "monstrosity",
  "alignment": "unaligned",
  "cr": "9 (5,000 XP)",
  "hp": "112 (15d6 + 60)",
  "ac": "16 (natural armor)",
  "speed": "50 ft.",
  "skills": "Perception +8, Stealth +7",
  "immunities": "poison",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical weapons not made of adamantine",
  "conimmunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 18",
  "languages": "--",
  "abilities": {
    "str": 22,
    "dex": 16,
    "con": 18,
    "int": 12,
    "wis": 18,
    "cha": 13
  },
  "traits": [
    {
      "name": "Innate Spellcasting",
      "desc": "The gem dog’s spellcasting ability is Wisdom (spell save DC 16, +8 to hit with spell attacks). The gem dog can innately cast the following spells, requiring no material, verbal, or somatic components: * At will: <i>color spray, dancing lights, faerie fire</i> * 3/day each: <i>blur, heat metal, hypnotic pattern, mirror image, misty step, moonbeam</i> * 1/day: <i>hallucinatory terrain</i>"
    },
    {
      "name": "Magic Resistance",
      "desc": "The gem dog has advantage on saving throws against spells and other magical effects."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The gem dog attacks once with its bite and twice with its claws, or it can make two Gem Spine Spray attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 28 (4d10 + 6) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 15 (2d8 + 6) slashing damage."
    },
    {
      "name": "Gem Spine Spray",
      "desc": "Ranged Weapon Attack: +7 to hit, range 20/60 ft., one target. Hit: 30 (5d10 + 3) piercing."
    },
    {
      "name": "Blinding Gleam",
      "desc": "If the gem dog is in bright light, it can force one creature that it can see within 60 feet of it to make a DC 16 Dexterity saving throw if the gem dog isn’t incapacitated. On a failed save, the creature is blinded for 1 minute as the gem dog reflects light into its eyes. A creature that isn’t surprised can avert its eyes to avoid the saving throw at the start of its turn. If it does so, it can’t see the gem dog until the start of its next turn, when it can avert its eyes again. If it looks at the gem dog in the meantime, it must immediately make the save."
    }
  ]
}