{
  "name": "Ghoul, Iron",
  "tags": [
    "medium",
    "undead",
    "cr5",
    "tome-of-beasts"
  ],
  "size": "Medium",
  "type": "undead",
  "alignment": "lawful evil",
  "cr": "5 (1800 XP)",
  "hp": "143 (22d8 + 44)",
  "ac": "16 (breastplate)",
  "speed": "30 ft., burrow 20 ft.",
  "immunities": "poison",
  "conimmunities": "charmed, exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "Common, Darakhul, Undercommon",
  "abilities": {
    "str": 18,
    "dex": 16,
    "con": 14,
    "int": 14,
    "wis": 14,
    "cha": 14
  },
  "traits": [
    {
      "name": "Turning Defiance",
      "desc": "The iron ghoul and any ghouls within 30 feet of it have advantage on saving throws against effects that turn undead."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The iron ghoul makes one bite attack and one claw attack, or three glaive attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 17 (3d8 + 4) piercing damage. If the target is a creature other than an elf or undead, it must succeed on a DC 13 Constitution saving throw or be paralyzed for 1 minute. The target repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. If the target is humanoid, it must succeed on a separate DC 13 Constitution saving throw or contract darakhul fever."
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 18 (4d6 + 4) slashing damage. If the target is a creature other than an elf or undead, it must succeed on a DC 13 Constitution saving throw or be paralyzed for 1 minute. The target repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. If the target is humanoid, it must succeed on a separate DC 13 Constitution saving throw or contract darakhul fever."
    },
    {
      "name": "Glaive",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 20 (1d10 + 4) slashing damage."
    },
    {
      "name": "Heavy Bone Crossbow",
      "desc": "Ranged Weapon Attack: +6 to hit, range 100/400, one target. Hit: 8 (1d10 + 3) piercing damage."
    }
  ]
}