{
  "name": "Giant Lynx",
  "tags": [
    "large",
    "celestial",
    "cr9",
    "tome-of-horrors"
  ],
  "size": "Large",
  "type": "celestial",
  "alignment": "chaotic good",
  "cr": "9 (5,000 XP)",
  "hp": "123 (13d10 + 52)",
  "ac": "17 (natural armor)",
  "speed": "40 ft., climb 30 ft.",
  "saves": "Wis +9, Cha +9",
  "skills": "Animal Handling +9, Insight +9, Perception +9, Stealth +10",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "charmed, exhaustion, frightened",
  "senses": "darkvision 120 ft., passive Perception 19",
  "languages": "all, telepathy 120 ft.",
  "abilities": {
    "str": 16,
    "dex": 22,
    "con": 19,
    "int": 17,
    "wis": 20,
    "cha": 20
  },
  "traits": [
    {
      "name": "Magic Resistance",
      "desc": "The giant lynx has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The giant lynx’s attacks are considered magical."
    },
    {
      "name": "Spellcasting",
      "desc": "The giant lynx is a 12th level spellcaster. The giant lynx’s spellcasting ability is Wisdom (spell save DC 17, +9 to hit with spell attacks). It can cast the following cleric spells: * Cantrips (at will): <i>guidance, light, mending, resistance, sacred flame, thaumaturgy</i> * 1st level (4 slots): <i>bless, cure wounds, detect evil and good, protection from evil and good</i> * 2nd level (3 slots): <i>aid, hold person, lesser restoration, spiritual weapon</i> * 3rd level (3 slots): <i>beacon of hope, dispel magic, revivify</i> * 4th level (3 slots): <i>banishment, death ward, locate creature</i> * 5th level (2 slots): <i>dispel evil and good, raise dead</i> * 6th level (1 slot): <i>heal</i>"
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The giant lynx makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 15 (2d8 + 6) slashing damage."
    },
    {
      "name": "Change Shape",
      "desc": "The giant lynx magically polymorphs into a humanoid or beast that has a challenge rating equal to or less than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the giant lynx’s choice). In a new form, the giant lynx retains its game statistics and ability to speak, but its AC, movement modes, Strength, Dexterity, and special senses are replaced by those of the new form, and it gains any statistics or capabilities (except class features, legendary actions, and lair actions) that the new form has but that it lacks."
    }
  ]
}