{
  "name": "Glass Wyrm",
  "tags": [
    "large",
    "dragon",
    "cr11",
    "tome-of-horrors"
  ],
  "size": "Large",
  "type": "dragon",
  "alignment": "neutral",
  "cr": "11 (7,200 XP)",
  "hp": "105 (10d10 + 50)",
  "ac": "17 (natural armor)",
  "speed": "30 ft., fly 60 ft.",
  "saves": "Dex +4, Con +9, Wis +4, Cha +8",
  "skills": "Arcana +6, Insight +4, Perception +8, Persuasion +8, Stealth +4",
  "immunities": "poison",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical weapons",
  "vulnerability": "thunder",
  "conimmunities": "paralyzed, poisoned, unconscious",
  "senses": "darkvision 60 ft., passive Perception 18",
  "languages": "Draconic, Undercommon",
  "abilities": {
    "str": 23,
    "dex": 10,
    "con": 21,
    "int": 14,
    "wis": 11,
    "cha": 19
  },
  "traits": [
    {
      "name": "Legendary Resistance (3/day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Spell Reflection",
      "desc": "Any time the glass wyrm is targeted by a magic missile spell, a line spell, or a spell that requires a ranged attack roll, roll a d6. On a 1 to 5, the dragon is unaffected. On a 6, the dragon is unaffected, and the effect is reflected back at the caster as though it originated from the dragon, turning the caster into the target."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The glass wyrm uses its blinding reflection ability, and makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 15 (2d8 + 6) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) slashing damage."
    },
    {
      "name": "Blinding Reflection",
      "desc": "The glass wyrm reflects available light in a burst of radiance out to a 30-foot radius. Creatures that can see the glass wyrm in the area must succeed on a DC 17 Dexterity saving throw or be blinded for 1 minute. A blinded creature can attempt a DC 17 Constitution saving throw at the end of each of its turns, ending the blinded condition on a success. The glass wyrm can’t use this ability if it does not begin its turn within the dim light or bright light radius of a light source."
    },
    {
      "name": "Glass Shards (Recharge 5–6)",
      "desc": "The glass wyrm breaths a 40-foot cone of glass razor-like glass shards. Creatures in the area must succeed on a DC 17 Dexterity saving throw, taking 54 (12d8) piercing damage on a failed saving throw, or half as much damage on a successful one."
    }
  ]
}