{
  "name": "Haloed Reaper",
  "tags": [
    "large",
    "celestial",
    "cr13",
    "nerzugals-extended-bestiary"
  ],
  "size": "Large",
  "type": "celestial",
  "alignment": "chaotic evil",
  "cr": "13 (10,000 XP)",
  "hp": "178 (17d10 + 85)",
  "ac": "18 (natural armor)",
  "speed": "30 ft., fly 90 ft.",
  "saves": "Con +9, Wis +9, Cha +8",
  "skills": "Acrobatics +9, Perception +10",
  "resistance": "necrotic; bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "charmed, exhausted, frightened",
  "senses": "darkvision 120ft., passive Perception 19",
  "languages": "all, telepathy 120 ft.",
  "abilities": {
    "str": 24,
    "dex": 18,
    "con": 21,
    "int": 19,
    "wis": 20,
    "cha": 19
  },
  "traits": [
    {
      "name": "Blinding Blades",
      "desc": "The reaper's weapon attacks are magical. When the reaper hits with any weapon, the weapon deals an extra 3d8 necrotic damage and if the target is a creature it must succeed on a DC 15 Constitution saving throw or become blinded until the reaper's next turn (included in the attack)."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The reaper's spellcasting ability is Charisma (spell save DC 16). The seraph can innately cast the following spells, requiring only verbal components. * At will: <i>detect evil and good, hunter's mark </i>(at 5th level)<i>, invisibility </i>(self only) * 2/day each: <i>destructive wave </i>(necrotic only), <i>dimension door</i> * 1/day each: <i>disintegrate, flesh to stone</i>"
    },
    {
      "name": "Magic Resistance",
      "desc": "The reaper has advantage on saving throws against spells and other magical effects."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The reaper makes two melee attacks, only one of which can be a decaying touch."
    },
    {
      "name": "Grand Scythe",
      "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 19 (2d12 + 7) slashing damage plus 13 (3d8) necrotic damage and if the target is a creature it must succeed on a DC 18 Constitution saving throw or become blinded until the reaper's next turn"
    },
    {
      "name": "Cleaving Swipe",
      "desc": "The reaper spins its scythe in an arcing slash. Make an attack against each enemy within reach of the reaper's grand scythe, making a separate attack roll against each target."
    },
    {
      "name": "Reap",
      "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 40 necrotic damage. If the target is a creature that has fewer than 20 hit points after this attack, it must succeed on a DC 15 Constitution saving throw or immediately die. If the creature dies as a result of this attack, the reaper regains 40 hit points."
    },
    {
      "name": "Decaying Touch (3/Day)",
      "desc": "Melee Spell Attack: +9 to hit, reach 5 ft., one target. Hit: 49 (10d8 + 4) necrotic damage."
    },
    {
      "name": "Binding Halo (Recharge 5-6)",
      "desc": "The reaper extends its scythe and launches a black halo at two creatures it can see within 120 feet. These creatures must succeed on a DC 18 Dexterity saving throw or become restrained. A restrained creature takes 18 (4d8) necrotic damage at the start of its turn and can make a DC 18 Strength saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ]
}