{
  "name": "Kamadan",
  "tags": [
    "Large",
    "monstrosity",
    "cr4",
    "tomb-of-annihilation"
  ],
  "size": "Large",
  "type": "monstrosity",
  "alignment": "unaligned",
  "cr": "4 (1,100 XP)",
  "hp": "67 (9d10 +18)",
  "ac": "13",
  "speed": "30 ft.",
  "skills": "Perception +4, Stealth +7",
  "senses": "passive Perception 14",
  "abilities": {
    "str": 16,
    "dex": 16,
    "con": 14,
    "int": 3,
    "wis": 14,
    "cha": 10
  },
  "traits": [
    {
      "name": "Keen Smell",
      "desc": "The kamadan has advantage on Wisdom (Perception) checks that rely on smell."
    },
    {
      "name": "Pounce",
      "desc": "If the kamadan moves at least 20 feet straight toward a creature and then hits it with a claw attack on the same turn, that target must succeed on a DC 13 Strength saving throw or be knocked prone. If the target is knocked prone, the kamadan can make two attacks -one with its bite and one with its snakes- against it as a bonus action."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The kamadan makes two attacks: one with its bite or claw and one with its snakes."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (ld6 +3) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target.Hit: 6 (ld6 +3) slashing damage."
    },
    {
      "name": "Snakes",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (ld6 +3) piercing damage, and the target must make a DC 12 Constitution saving throw, taking 21 (6d6) poison damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Sleep Breath (Recharges after a Short or Long Rest)",
      "desc": "The kamadan exhales sleep gas in a 30-foot cone. Each creature in that area must succeed on a DC 12 Constitution saving throw or fall unconscious for 10 minutes. This effect ends for a creature if it takes damage or someone uses an action to wake it."
    }
  ]
}