{
  "name": "Mage Hunter",
  "tags": [
    "medium",
    "humanoid",
    "cr3",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any alignment",
  "cr": "3 (700 XP)",
  "hp": "52 (7d10 + 14)",
  "ac": "17 (splint mail)",
  "speed": "30 ft.",
  "saves": "Str +3, Dex +2, Con +5, Int +4, Wis +6, Cha +9",
  "skills": "Arcana +4, Athletics +6, Deception +6, Insight +3",
  "senses": "passive Perception 10",
  "languages": "Any two languages",
  "abilities": {
    "str": 16,
    "dex": 8,
    "con": 14,
    "int": 12,
    "wis": 10,
    "cha": 16
  },
  "traits": [
    {
      "name": "Divine Smite",
      "desc": "When the hunter hits with a melee weapon attack, it can expend a spell slot to deal an addition 9 (2d8) radiant damage, in addition to the weapon's damage. This damage increases by 1d8 radiant damage per spell slot level above 1st."
    },
    {
      "name": "Great Weapon Fighting Style",
      "desc": "When the hunter rolls a 1 or 2 on a damage die for an attack with its pike, it can reroll that die and take the second result."
    },
    {
      "name": "Spellcasting",
      "desc": "The hunter is a 6th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). The hunter has the following paladin spells prepared: * 1st level (4 slots): <i>bane, detect magic, hunter's mark, shield of faith</i> * 2nd level (2 slots): <i>hold person, magic weapon, misty step</i>"
    },
    {
      "name": "Vow of Enmity (1/Day)",
      "desc": "As a bonus action, the hunter utters a vow against a creature it can see within 10 feet. The hunter has advantage on attack rolls against that creature for 1 minute or until the creature falls to 0 hit points or falls unconscious."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The hunter makes two attacks with its pike."
    },
    {
      "name": "Pike",
      "desc": "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 8 (1d10 + 3) piercing damage."
    },
    {
      "name": "Lay on Hands (2/Day)",
      "desc": "The hunter touches a creature and restores 15 hit points to it."
    },
    {
      "name": "Spell Slash",
      "desc": "When a creature within 10 feet of the hunter casts a spell, it can use its reaction to make a weapon attack against that creature. If that creature is concentrating on a spell, it has disadvantage on the saving throw to maintain its concentration."
    }
  ]
}