{
  "name": "Minotaur Totem Warrior",
  "tags": [
    "large",
    "monstrosity",
    "cr4",
    "nerzugals-extended-bestiary"
  ],
  "size": "Large",
  "type": "monstrosity",
  "alignment": "chaotic evil",
  "cr": "4 (1,100 XP)",
  "hp": "85 (10d10 + 30)",
  "ac": "15 (natural armor)",
  "speed": "40 ft.",
  "skills": "Athletics +6, Perception +7",
  "senses": "darkvision 60ft., passive Perception 17",
  "languages": "Abyssal",
  "abilities": {
    "str": 19,
    "dex": 10,
    "con": 17,
    "int": 6,
    "wis": 16,
    "cha": 8
  },
  "traits": [
    {
      "name": "Labyrinthine Recall",
      "desc": "The minotaur can perfectly recall any path it has traveled."
    },
    {
      "name": "Battering Ram",
      "desc": "If the minotaur moves at least 10 feet straight towards a target and then hits it with a totem attack on the same turn, the target takes an extra 9 (2d8) bludgeoning damage. If the target is a creature, it must succeed on a DC 14 Strength saving throw or be pushed up to 20 feet and knocked prone. If the target is a structure, this attack deals double damage."
    }
  ],
  "actions": [
    {
      "name": "Totem",
      "desc": "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 17 (2d12 + 4) bludgeoning damage."
    },
    {
      "name": "Totemic Smash (Recharge 5-6)",
      "desc": "The minotaur smashes its totem on the ground, causing a shockwave to ripple forth in a 15-foot cone. Each creature in this area must make a DC 14 Dexterity saving throw, taking 11 (2d10) bludgeoning damage and 11 (2d10) thunder damage on a failed saving throw, or half as much damage on a successful one. Creatures that fail this saving throw by 5 or more also fall prone."
    },
    {
      "name": "Totemic Armor",
      "desc": "The minotaur stands strong and calls upon its inner strength to toughen its flesh from incoming attacks. When an enemy hits the minotaur with an attack that it can see, the minotaur can use its reaction to halve the damage of that attack."
    }
  ]
}