{
  "name": "Minotaur Rampager",
  "tags": [
    "large",
    "monstrosity",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Large",
  "type": "monstrosity",
  "alignment": "chaotic evil",
  "cr": "5 (1,800 XP)",
  "hp": "114 (12d10 + 48)",
  "ac": "15 (natural armor)",
  "speed": "40 ft.",
  "skills": "Athletics +9, Perception +9",
  "resistance": "bludgeoning, piercing, and slashing damage from nonmagical weapons (if at or above half of its maximum hit points)",
  "senses": "darkvision 60ft., passive Perception 19",
  "languages": "Abyssal",
  "abilities": {
    "str": 21,
    "dex": 10,
    "con": 19,
    "int": 9,
    "wis": 17,
    "cha": 12
  },
  "traits": [
    {
      "name": "Labyrinthine Recall",
      "desc": "The minotaur can perfectly recall any path it has traveled."
    },
    {
      "name": "Endless Fury",
      "desc": "The minotaur's rage makes it blind to the pain being inflicted upon it until it feels the possibility of death is a reality, at which point it uses a new surge of adrenaline to bring a new deadly strength to every strike. As long as the minotaur is at or above half of its maximum hit points, it has resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons. As long as the minotaur is below half of maximum hit points, its strength bonus is doubled for all of its attacks (included in the attacks)."
    }
  ],
  "actions": [
    {
      "name": "Greatmaul",
      "desc": "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 18 (2d12 + 5) bludgeoning damage, or 23 (2d12 + 10) if the minotaur is below half of its maximum hit points."
    },
    {
      "name": "Hoof Stomp",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one prone creature. Hit: 24 (3d12 + 5) bludgeoning damage or 29 (3d12 + 10) if the minotaur is below half of its maximum hit points.."
    },
    {
      "name": "Rampaging Charge (Recharge 5-6)",
      "desc": "The minotaur expends all of its movement to charge up to 40 feet in a straight line. Each creature in the minotaur's path must succeed on a DC 16 Dexterity saving throw or be pushed up to 10 feet to either side of the minotaur's path, knocked prone, and take 32 (5d12) bludgeoning damage. A creature that succeeds on the saving throw takes half as much damage and is pushed but not knocked prone. This movement by the minotaur does not provoke attacks of opportunity."
    }
  ]
}