{
  "name": "Mirager",
  "tags": [
    "medium",
    "fey",
    "cr3",
    "tome-of-beasts"
  ],
  "size": "Medium",
  "type": "fey",
  "alignment": "neutral evil",
  "cr": "3 (700 XP)",
  "hp": "78 (12d8 + 24)",
  "ac": "13",
  "speed": "30 ft.",
  "skills": "Deception +7, Performance +9, Perception +4",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Common, Sylvan",
  "abilities": {
    "str": 12,
    "dex": 16,
    "con": 14,
    "int": 10,
    "wis": 14,
    "cha": 20
  },
  "traits": [
    {
      "name": "Shapechanger",
      "desc": "The mirager can use its action to polymorph into a Small or Medium humanoid, or back into its true form. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The mirager's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast the following spells, requiring no material components: * 3/day: <i>charm person</i> * 1/day each: <i>hallucinatory terrain, suggestion</i>"
    },
    {
      "name": "Enthralling Mirage",
      "desc": "When the mirager casts <i>hallucinatory terrain</i>, the area appears so lush and inviting that those who view it feel compelled to visit. Any creature that approaches within 120 feet of the terrain must make a DC 15 Wisdom saving throw. Those that fail are affected as by the <i>enthrall</i> spell with the mirager as the caster; they give the mirage their undivided attention, wanting only to explore it, marvel at its beauty, and rest there for an hour. The mirager can choose to have creatures focus their attention on itself instead of the <i>hallucinatory terrain</i>. Creatures affected by the <i>enthrall</i> effect automatically fail saving throws to disbelieve the <i>hallucinatory terrain</i>. This effect ends if the <i>hallucinatory terrain</i> is dispelled."
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "desc": "The mirager makes two slam attacks."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage."
    },
    {
      "name": "Thirst Kiss",
      "desc": "Melee Weapon Attack: reach 5 ft., one charmed, grappled, or incapacitated target. The mirager feeds on the body moisture of creatures it lures into kissing it. A kiss hits automatically, does 21 (6d6) necrotic damage, and fills the mirager with an exultant rush of euphoria that has the same effect as a <i>heroism</i> spell lasting 1 minute. The creature that was kissed doesn't notice that it took damage from the kiss unless it makes a successful DC 16 Wisdom (Perception) check."
    },
    {
      "name": "Captivating Dance (Recharges after a Short or Long Rest, Humanoid Form Only)",
      "desc": "The mirager performs a sinuously swaying dance. Humanoids within 20 feet that view this dance must make a successful DC 16 Wisdom saving throw or be stunned for 1d4 rounds and charmed by the mirager for 1 minute. Humanoids of all races and genders have disadvantage on this saving throw. A creature that saves successfully is immune to this mirager's dance for the next 24 hours."
    }
  ]
}