{
  "name": "Mongrelfolk",
  "tags": [
    "medium",
    "humanoid",
    "cr1/4",
    "curse-of-strahd"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any alignment",
  "cr": "1/4 (50 XP)",
  "hp": "26 (4d8+8)",
  "ac": "11 (natural armor)",
  "speed": "20 ft.",
  "skills": "Deception +2, Perception +2, Stealth +3",
  "languages": "Common",
  "abilities": {
    "str": 12,
    "dex": 9,
    "con": 15,
    "int": 9,
    "wis": 10,
    "cha": 6
  },
  "traits": [
    {
      "name": "Extraordinary Feature",
      "desc": "The mongrelfolk has one of the following extraordinary features, determined randomly by rolling a d20 or chosen by the DM: * ***1-3*** - Amphibious: The mongrelfolk can breathe air and water. * ***4-9*** - Darkvision: The mongrelfolk has darkvision out to a range of 60 feet. * ***10*** - Flight: The mongrelfolk has leathery wings and a flying speed of 40 feet. * ***11-15*** - Keen Hearing and Smell: The mongrelfolk has advantage on Wisdom (Perception) checks that rely on hearing or smell. * ***16-17*** - Spider Climb: The mongrelfolk can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check. * ***18-19*** - Standing Leap: The mongrelfolk's long jump is up to 20 feet and its high jump up to 10 feet, with or without a running start. * ***20*** - Two-Headed: The mongrelfolk has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious."
    },
    {
      "name": "Mimicry",
      "desc": "The mongrelfolk can mimic any sounds it has beard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mongrelfolk makes two attacks: one with its bite and one with its claw or dagger."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4+1) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4+1) slashing damage."
    },
    {
      "name": "Dagger",
      "desc": "Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 3 (1d4+1) piercing damage."
    }
  ]
}