{
  "name": "Monk of the Scattered Sands",
  "tags": [
    "medium",
    "humanoid",
    "cr4",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "neutral good",
  "cr": "4 (450 XP)",
  "hp": "65 (10d8 + 20)",
  "ac": "16 (unarmored defense)",
  "speed": "40 ft.",
  "saves": "Dex +6, Wis +6",
  "skills": "Acrobatics +5, Medicine +5, Religion +2",
  "senses": "passive Perception 13",
  "languages": "any three languages",
  "abilities": {
    "str": 10,
    "dex": 16,
    "con": 14,
    "int": 10,
    "wis": 16,
    "cha": 11
  },
  "traits": [
    {
      "name": "Sand Glide",
      "desc": "The monk has a flight speed of 20 ft. as sands swirl to carry it. This benefit works only in short bursts; the monk falls at the end of its turn if it is in the air and nothing else is holding it aloft."
    },
    {
      "name": "Unarmored Defense",
      "desc": "While the monk is wearing no armor and wielding no shield, its AC incluces its Wisdom modifier."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The monk makes three attacks with its quarterstaff. It can also use Manipulate Sands once, either before or after one of the attacks."
    },
    {
      "name": "Quarterstaff",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage."
    },
    {
      "name": "Manipulate Sands",
      "desc": "The monk sends a stream of sand at a target within 30 ft. The target must make a DC 13 Dexterity saving throw, taking 15 (6d4) bludgeoning damage and becoming blinded until the end of their next turn on a fail, or half as much damage and are not blinded on a success."
    },
    {
      "name": "Dancing Winds (2/Day)",
      "desc": "When the monk is targeted by a ranged spell attack with no other targets, it can quickly kick up a spiral of wind that alters its trajectory away from the monk. The monk takes no damage from this attack. As part of the same reaction, the monk makes a ranged spell attack against another creature within 60 ft. with a +5 bonus to the attack roll. On a hit, the spell strikes the new target instead."
    }
  ]
}