{
  "name": "Mudbog",
  "tags": [
    "large",
    "ooze",
    "cr2",
    "tome-of-horrors"
  ],
  "size": "Large",
  "type": "ooze",
  "alignment": "unaligned",
  "cr": "2 (450 XP)",
  "hp": "51 (6d10 + 18)",
  "ac": "9",
  "speed": "10 ft., swim 10 ft.",
  "skills": "Stealth +1",
  "immunities": "acid, psychic",
  "resistance": "fire",
  "conimmunities": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 10",
  "languages": "--",
  "abilities": {
    "str": 20,
    "dex": 8,
    "con": 17,
    "int": 1,
    "wis": 10,
    "cha": 3
  },
  "traits": [
    {
      "name": "Acid",
      "desc": "A mudbog secretes a digestive acid that quickly dissolves organic material, but not metal or stone. A creature that attacks the mudbog takes 3 (1d6) acid damage. Any wood or other organic material that touches the mudbog is pitted. Wooden weapons suffer a cumulative –1 penalty to damage rolls made with it unless it is magical. When this penalty reaches –5, the weapon is destroyed."
    },
    {
      "name": "Amorphous",
      "desc": "The ooze can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "False Appearance",
      "desc": "The mudbog, while not moving, is indistinguishable from a muddy puddle."
    }
  ],
  "actions": [
    {
      "name": "Engulf",
      "desc": "The mudbog moves up to its speed. While doing so, it can enter Medium or smaller creatures’ spaces. Whenever the mudbog enters a creature’s space, the creature must make a DC 13 Dexterity saving throw. On a successful save, the creature can choose to be pushed 5 feet back or to the side of the mudbog. A creature that chooses not to be pushed suffers the consequences of a failed saving throw. On a failed save, the creature is engulfed and the mudbog enters the creature’s space. The creature takes 10 (3d6) acid damage. The engulfed creature can’t breathe, is restrained, and takes 21 (6d6) acid damage at the start of each of the ooze’s turns. When the mudbog moves, the engulfed creature moves with it. An engulfed creature can try to escape by taking an action to make a DC 13 Strength check. On a success, the creature escapes and enters a space of its choice within 5 feet of the ooze."
    }
  ]
}