{
  "name": "Mystic Spellblade",
  "tags": [
    "medium",
    "humanoid",
    "cr5",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "lawful evil (50%) or lawful good (50%)",
  "cr": "5 (1,800 XP)",
  "hp": "105 (14d8 + 42)",
  "ac": "16 (breastplate)",
  "speed": "30 ft.",
  "saves": "Str +5, Int +7",
  "skills": "Arcana +7, Insight +4, Religion +7",
  "senses": "passive Perception 11",
  "languages": "Celestial and any three other languages",
  "abilities": {
    "str": 15,
    "dex": 10,
    "con": 16,
    "int": 18,
    "wis": 12,
    "cha": 10
  },
  "traits": [
    {
      "name": "Spiritual Alignment",
      "desc": "The spellblade is unarmed, but has two spectral weapons that follow it constantly, one a longsword and the other a flail. These weapons act according to the spellblade’s will. On the spellblade’s turn, it may give mental commands to these weapons to have them move up to 30 feet."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The spellblade uses its Spiritual Suppression if able. It then makes one attack with its spectral longsword and one attack with its spectral flail."
    },
    {
      "name": "Spectral Longsword",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5ft., one target. Hit: 8 (1d8 + 4) force damage."
    },
    {
      "name": "Spectral Flail",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5ft., one target. Hit: 8 (1d8 + 4) force damage."
    },
    {
      "name": "Spiritual Suppression (Recharge 5-6)",
      "desc": "The spellblade summons a set of ethereal bindings to subdue a target within 90 feet. The target must succeed on a DC 14 Strength saving throw or become restrained for 1 minute. The target can repeat this saving throw at the end of their turn, ending the effect on a success."
    },
    {
      "name": "Relentless Assault (1/Day)",
      "desc": "The spellblade summons 5 new spectral longswords at its side. One at a time it grabs hold of these blades. When the spellblade grabs a new longsword, it may teleport up to 120 feet into an unoccupied space and attack a creature within 5 feet. It makes a separate attack roll for each longsword attack. Hit or miss, after each attack the spectral weapon fades away. When all of the swords have been expended, the spellblade teleports back to its original location."
    },
    {
      "name": "Spiritual Barrier",
      "desc": "The spellblade adds 3 to the result of any spell saving throw by boosting its fortitude with spiritual energy."
    }
  ]
}