{
  "name": "Noxious Savageclaw",
  "tags": [
    "medium",
    "aberration",
    "cr2",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "aberration",
  "alignment": "chaotic evil",
  "cr": "2 (450 XP)",
  "hp": "39 (6d8 + 12)",
  "ac": "16 (natural armor)",
  "speed": "40 ft.",
  "immunities": "poison",
  "conimmunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "--",
  "abilities": {
    "str": 16,
    "dex": 12,
    "con": 14,
    "int": 2,
    "wis": 12,
    "cha": 1
  },
  "traits": [
    {
      "name": "Poison Trail",
      "desc": "The savageclaw’s body exudes poison in a 5 foot cube around it. Whenever the savageclaw moves, this poison follows along and fills every space the savageclaw touched during its movement. This poison dissipates after 1 round. Any creature that moves through one of these poison clouds must succeed on a DC 12 Constitution saving throw or take 9 (2d8) poison damage. A creature that holds their breath while moving through one of these spaces has advantage on the saving throw."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The savageclaw makes two attacks with its bite."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5ft., one target. Hit: 7 (1d8 + 3) piercing damage."
    },
    {
      "name": "Poison Tail",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 7 (2d6) poison damage and the target must succeed on a DC 12 Constitution saving throw or become poisoned for 1 minute. Creatures poisoned in this way cannot use reactions. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    {
      "name": "Noxious Discharge (1/Day)",
      "desc": "The savageclaw lets out a powerful blast of poison gas in a 15 foot cube originating on itself. Any creature in this area must make a DC 12 Constitution saving throw, taking 13 (3d8) poison damage on a failed save, or half as much damage on a successful one."
    }
  ]
}