{
  "name": "Obsidian Drake",
  "tags": [
    "huge",
    "dragon",
    "cr13",
    "nerzugals-extended-bestiary"
  ],
  "size": "Huge",
  "type": "dragon",
  "alignment": "chaotic evil",
  "cr": "13 (10,000 XP)",
  "hp": "207 (18d12 + 90)",
  "ac": "18 (natural armor)",
  "speed": "40 ft., fly 80 ft.",
  "saves": "Dex +6, Con + 10, Wis +7, Cha +8",
  "skills": "Deception +8, Insight +7, Perception +7, Persuasion +8, Stealth +6",
  "immunities": "fire",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 17",
  "languages": "Common, Draconic",
  "abilities": {
    "str": 21,
    "dex": 12,
    "con": 20,
    "int": 16,
    "wis": 14,
    "cha": 15
  },
  "traits": [
    {
      "name": "Molten Core",
      "desc": "The drake’s melee attacks have a chance to set their target ablaze (included in the attacks below)."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The drake makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 16 (2d10 + 5) piercing damage and the target must succeed on a DC 18 Constitution saving throw or be set ablaze. Until a creature takes an action to douse the fire, the target takes 5 (1d10) fire damage at the start of each of its turns."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) slashing damage and the target must succeed on a DC 18 Constitution saving throw or be set ablaze. Until a creature takes an action to douse the fire, the target takes 5 (1d10) fire damage at the start of each of its turns."
    },
    {
      "name": "Breath Weapon (Recharge 5-6)",
      "desc": "The dragon uses one of the following breath weapons. * ***Lava Breath.*** The drake exhales lava in a 30-foot cone. Each creature in that area must make a DC 18 Dexterity saving throw, taking 42 (12d6) fire damage on a failed save, or half as much damage on a successful one. This area becomes coated in lava and is considered difficult terrain. Creatures that move through an area covered in lava take 5 (1d10) fire damage for every 5 feet they move. A creature that ends its turn in this area takes 16 (3d10) fire damage. * ***Ashen Breath.*** The drake exhales a blast of hot ash and flame in a 60-foot cone. Each creature in this area must make a DC 18 Strength saving throw, taking 28 (8d6) fire damage and being pushed 15 feet on a failed save, or half as much damage and not pushed on a successful one. Each creature that failed this save must also succeed on a DC 18 Constitution saving throw or be blinded until the end of their next turn."
    },
    {
      "name": "Molten Obsidian (3/Day)",
      "desc": "The drake attempts to turn a burning target it can see to obsidian. That creature must succeed on a DC 18 Constitution saving throw against being magically petrified. On a failed save, the fire on their body turns to lava and begins to envelop them. The creature is considered restrained and takes 55 (10d10) fire damage. It must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is petrified as they turn to obsidian. The petrification lasts until the creature is healed by the greater restoration spell or other such magic."
    },
    {
      "name": "Create Volcano (1/Day)",
      "desc": "The drake slams a claw in the ground and causes a volcano to rise up at a target location within 120 ft. This volcano is 30 ft. high with a 5 foot radius mouth and a 20 foot radius base. The volcano begins to erupt, going dormant after 1 minute. While the volcano is erupting, on initiative count 20 (losing ties), the following effects occur: * Lava flows out 10 feet in every direction from the mouth of the volcano. This area is considered difficult terrain. Creatures that move through an area covered in lava take 11 (2d10) fire damage for every 5 feet they move. * Boulders erupt from the volcano and into the sky. One of these boulders flies towards a random creature within 120 feet of the volcano (including the drake). That creature must succeed on a DC 10 Dexterity saving throw or take 44 (8d10) bludgeoning damage."
    }
  ],
  "legendary": [
    {
      "name": "Claw or Bite",
      "desc": "The drake makes one claw or bite attack."
    },
    {
      "name": "Detect",
      "desc": "The drake makes a Wisdom (Perception) check."
    },
    {
      "name": "Molten Obsidian (Costs 2 Actions)",
      "desc": "The drake uses its Molten Obsidian ability."
    }
  ]
}