{
  "name": "Oleander Dragon",
  "tags": [
    "large",
    "dragon",
    "cr8",
    "strongholds-and-followers"
  ],
  "size": "Large",
  "type": "dragon",
  "alignment": "chaotic neutral",
  "cr": "8 (3,900 XP)",
  "hp": "119 (14d10 + 42)",
  "ac": "16 (natural armor)",
  "speed": "40 ft., fly 40 ft.",
  "saves": "Dex +6, Int +6, Wis +8, Cha +6",
  "skills": "Arcana +6, Insight +8, Nature +6, Perception +8, Stealth +6",
  "resistance": "poison, psychic",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23",
  "languages": "Draconic, Elven, Sylvan",
  "abilities": {
    "str": 12,
    "dex": 16,
    "con": 16,
    "int": 16,
    "wis": 20,
    "cha": 16
  },
  "traits": [
    {
      "name": "Shapechanger",
      "desc": "As an action, the dragon can polymorph into a Small or Medium humanoid or back into its true form. Its statistics, other than its size, are the same in each form. Any worn or carried equipment isn’t transformed. It reverts to its true form if it dies."
    },
    {
      "name": "Magic Resistance",
      "desc": "The dragon has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "False Appearance",
      "desc": "While the dragon remains motionless, it is indistinguishable from a shrub or small tree of blooming oleander."
    }
  ],
  "actions": [
    {
      "name": "Implant Nightmare",
      "desc": "The dragon reaches into the mind of a target it can see within 60 feet and manifests the target’s deepest fear. The target must make a DC 16 Wisdom saving throw. On a failed save, the target becomes frightened for 1 minute. At the start of each of the target’s turns, the target must repeat the saving throw or take 22 (4d10) psychic damage. On a successful save, the nightmare ends."
    },
    {
      "name": "Pollen Breath (Recharge 5–6)",
      "desc": "The dragon exhales a swirling cloud of pollen and red and purple petals in a 60-foot cone. Each creature in the area must make a DC 16 Wisdom saving throw. On a failed save, the creature becomes charmed until the end of their next round. Creatures who successfully save cannot be affected by Pollen Breath for 24 hours."
    },
    {
      "name": "Song of Cestilani (1/Day)",
      "desc": "The oleander dragon sings a magical song. Each enemy that can hear it must succeed on a DC 16 Intelligence saving throw or take 22 (4d8 + 4) psychic damage and be stunned for 1 minute. A creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ]
}