{
  "name": "Picnic Hag",
  "tags": [
    "medium",
    "fey",
    "cr6",
    "out-of-the-box-5e"
  ],
  "size": "Medium",
  "type": "fey",
  "alignment": "chaotic evil",
  "cr": "6 (2,300 XP)",
  "hp": "95 (10d8 + 50)",
  "ac": "17 (natural armor)",
  "speed": "30 ft.",
  "saves": "Con +8",
  "skills": "Athletics +8, Perception +5",
  "immunities": "poison",
  "resistance": "Bludgeoning, Piercing And Slashing From Nonmagical Attacks",
  "conimmunities": "poisoned",
  "senses": "darkvision 60 ft., Passive Perception 15",
  "languages": "Common, Sylvan",
  "abilities": {
    "str": 21,
    "dex": 12,
    "con": 21,
    "int": 14,
    "wis": 14,
    "cha": 10
  },
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The hag makes three attacks: one with her jaw and two with her claws."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 15 (3d6 + 5) slashing damage."
    },
    {
      "name": "Unhinge Jaw",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 15 (3d6 + 5) piercing damage, and the target is grappled (escape DC 15). Until the grapple ends, the target is restrained, and the hag can’t bite another target. ***Swallow.** The hag makes a jaw attack against a Medium or smaller target it is grappling. If the attack hits, the target is swallowed, and the grapple ends. The swallowed target is blinded and restrained, it has total cover against attacks and other effects outside the hag, and it takes 10 (4d4) acid damage at the start of each of the hag’s turns. The hag can have only one target swallowed at a time. If the hag takes 20 damage or more on a single turn from a creature inside it, the hag must succeed on a DC 20 Constitution saving throw at the end of that turn or regurgitate the creature, which falls prone in a space within 10 feet of the hag. If the hag dies, a swallowed creature is no longer restrained by it and can escape from the corpse using 5 feet of movement, exiting prone."
    },
    {
      "name": "You Are What You Eat",
      "desc": "If the hag has swallowed a creature, it can use one of that creature’s actions as if it were that creature. The hag’s physical form mutates to reflect its stomach’s contents."
    },
    {
      "name": "Belch",
      "desc": "When a creature damages the hag, she can choose to belch noxious gas. Each creature in a 15-foot cone originating from the hag must make a DC 15 Constitution saving throw, taking 10 (3d6) poison damage on a failed save or half as much damage on a successful one. If the hag has swallowed a creature she can choose to eject the creature as part of her belch, depositing it prone within 10 feet of her."
    }
  ]
}