{
  "name": "Primeval Strix",
  "tags": [
    "large",
    "monstrosity",
    "cr6",
    "nerzugals-extended-bestiary"
  ],
  "size": "Large",
  "type": "monstrosity",
  "alignment": "chaotic evil",
  "cr": "6 (2,300 XP)",
  "hp": "105 (14d10 + 28)",
  "ac": "14",
  "speed": "20 ft., fly 90 ft.",
  "saves": "Dex +7, Int +7, Cha +8",
  "skills": "Perception +5, History +7",
  "senses": "passive Perception 15",
  "languages": "Understands Common and Abyssal but can't speak",
  "abilities": {
    "str": 15,
    "dex": 18,
    "con": 15,
    "int": 18,
    "wis": 14,
    "cha": 20
  },
  "traits": [
    {
      "name": "Horrifying Visage",
      "desc": "When a creature that can see the strix's eyes starts its turn within 30 feet of the strix, the strix can force it to make a DC 15 Wisdom saving throw if the strix isn’t incapacitated and can see the creature. If the creature fails the saving throw, it becomes frightened. The frightened creature can repeat the saving throw at the end of its next turn, ending the effect on a success and becoming immune to the strix's horrifying visage for 24 hours. Unless surprised, a creature can avert its eyes to avoid the saving throw at the start of its turn. If the creature does so, it can't see the strix until the start of its next turn, when it can avert its eyes again. If a creature looks at the strix in the meantime, it must immediately make the save."
    },
    {
      "name": "Flyby",
      "desc": "The strix doesn't provoke attacks of opportunity when it flies out of an enemy's reach."
    },
    {
      "name": "Keen Sight",
      "desc": "The strix has advantage on Wisdom (Perception) checks that rely on sight."
    },
    {
      "name": "Omen of Ill Fortune",
      "desc": "Gazing upon a strix is considered to be a terrible omen that is sure to bring misfortune and suffering. A creature that sees the strix is plagued with bad luck. For the next hour, when that creature makes a skill check or an attack roll a d4 and subtract the result from the total."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The strix makes two attacks: one with its beak and one with its talons."
    },
    {
      "name": "Beak",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) piercing damage plus 4 (1d8) necrotic damage."
    },
    {
      "name": "Talons",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage plus 4 (1d8) necrotic damage."
    },
    {
      "name": "Thunderous Screech (Recharge 5-6)",
      "desc": "The strix unleashes a shrill screech in a 30 ft. cone. Each creature must make a DC 15 Constitution saving throw, taking 28 (8d6) thunder damage and becoming deafened for 1 minute on a failed save, or half as much damage and not deafened on a successful one."
    }
  ]
}