{
  "name": "Rasa Mastermind",
  "tags": [
    "medium",
    "humanoid",
    "cr4",
    "nerzugals-extended-bestiary"
  ],
  "size": "Medium",
  "type": "humanoid",
  "alignment": "any evil alignment",
  "cr": "4 (1,100 XP)",
  "hp": "91 (14d8 + 28)",
  "ac": "16 (studded leather)",
  "speed": "30 ft.",
  "skills": "Deception +5, Perception +5, Stealth +8",
  "senses": "passive Perception 15",
  "languages": "Common",
  "abilities": {
    "str": 12,
    "dex": 18,
    "con": 15,
    "int": 16,
    "wis": 13,
    "cha": 14
  },
  "traits": [
    {
      "name": "Innate Spellcasting",
      "desc": "The rasa's innate spellcasting ability is Intelligence (spell save DC 13). It can innately cast the following spells, requiring no components: * At will: <i>mage hand, message</i> * 1/day each: <i>arcane eye, greater invisibility, silent image</i> * 2/day each: <i>disguise self, misty step</i>"
    },
    {
      "name": "Inscrutable Intentions",
      "desc": "The rasa is immune to any magical effects to determine if it is lying."
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "desc": "The mastermind deals an extra 10 (3d6) damage when it hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of the mastermind that isn't incapacitated and the mastermind doesn't have disadvantage on the attack roll."
    },
    {
      "name": "Mask of Deceit",
      "desc": "While wearing this mask, the mastermind has advantage on Charisma (Deception) and Charisma (Performance) checks when trying to pass itself off as a different person. It also allows the wearer to mimic the speech of a creature it has heard speak for at least 1 minute. A successful Wisdom (Insight) check contested by the mastermind's Charisma (Deception) check allows a listener to determine that the voice is faked."
    },
    {
      "name": "Mask of Slaying",
      "desc": "While wearing this mask, when the mastermind takes the multiattack action, it makes two additional melee attacks."
    },
    {
      "name": "Sight of the Rasa",
      "desc": "The rasa share a special sight that is invisible to all non-rasa creatures. As an action, a rasa can touch a creature and place a secret mark on that creature's chest. This mark lets other rasa know whether or not this creature should be regarded as a friend or a foe."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mastermind makes two melee attacks, or makes a melee attack and uses its mask of dominance."
    },
    {
      "name": "Poisoned Dagger",
      "desc": "Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 6 (1d4 + 4) piercing damage plus 3 (1d6) poison damage."
    },
    {
      "name": "Phantom Strikes (Recharge 5-6)",
      "desc": "The mastermind summons three ethereal clones in unoccupied spaces within 60 feet. These clones immediately make two dagger attacks against a creature within 5 feet. These attacks are made with a +6 bonus to hit and deal 10 (3d6) force damage. Once these attacks are completed, the mastermind can teleport to the location of any of these clones and the clones disappear."
    },
    {
      "name": "Mask of Dominance (1/Day)",
      "desc": "The mastermind places a mask of dominance on the face of a creature it is currently grappling. That creature must succeed on a DC 14 Wisdom saving throw or become charmed by the mastermind. While charmed, the creature obeys all commands of the mastermind that do not inflict self-harm. This effect ends after 24 hours or when another creature uses its action to pry the mask from the charmed creature's face."
    }
  ]
}