{
  "name": "Rocket Automaton",
  "tags": [
    "small",
    "construct",
    "cr1",
    "homebrew"
  ],
  "size": "Small",
  "type": "construct",
  "alignment": "unaligned",
  "cr": "1 (200 XP)",
  "hp": "9 (2d6 + 2)",
  "ac": "15 (natural armor)",
  "speed": "10 ft., fly 60 ft.",
  "skills": "Perception +4",
  "immunities": "poison, psychic",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical attacks that aren't adamantine",
  "conimmunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "understands one language known by its creator but can't speak",
  "abilities": {
    "str": 10,
    "dex": 16,
    "con": 13,
    "int": 3,
    "wis": 14,
    "cha": 1
  },
  "traits": [
    {
      "name": "Animated Explosive",
      "desc": "When it takes fire damage, or as an action on its turn, the automaton's fuse lights. At the start of each of the automaton's turns, roll a d4. On a result of 1, the automaton explodes in a 15- foot radius fireball at the start of its next turn, forcing each creature in the area to make a DC 12 Dexterity saving throw, taking 4 (1d8) fire damage plus 4 (1d8) bludgeoning damage on a failed save, or half as much on a successful one. If the automaton is killed, the fuse remains lit, potentially setting off the explosion after its death. If another creature hits the automaton with an unarmed strike attack, the creature can choose to snuff out the fuse instead of dealing damage."
    },
    {
      "name": "Flyby",
      "desc": "The automaton doesn't provoke opportunity attacks when it flies out of an enemy's reach."
    },
    {
      "name": "Immutable Form",
      "desc": "The automaton is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Siege Monster",
      "desc": "The automaton deals double damage to objects and structures."
    },
    {
      "name": "Rocket Flight",
      "desc": "The automaton can only use its fly speed once the rocket on its back is ignited. Once it lifts off, the automaton must use at least half of its flying speed on each of its turns, unless something prevents it from doing so. 1 minute after its rocket has been ignited, roll a d10 at the end of each of the automaton's turns. On a result of 1, the rocket's fuel is spent, and the automaton immediately begins to fall."
    }
  ],
  "actions": [
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) bludgeoning damage."
    }
  ]
}