{
  "name": "Rust Drake",
  "tags": [
    "medium",
    "dragon",
    "cr8",
    "tome-of-beasts"
  ],
  "size": "Medium",
  "type": "dragon",
  "alignment": "chaotic evil",
  "cr": "8 (3900 XP)",
  "hp": "161 (19d8 + 76)",
  "ac": "17 (natural armor)",
  "speed": "30 ft., burrow 5 ft., fly 100 ft.",
  "skills": "Perception +3, Stealth +5",
  "immunities": "poison",
  "vulnerability": "acid",
  "conimmunities": "paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "Common, Draconic",
  "abilities": {
    "str": 20,
    "dex": 15,
    "con": 19,
    "int": 12,
    "wis": 8,
    "cha": 8
  },
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The drake makes one bite attack and one tail swipe attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 18 (3d8 + 5) piercing damage, and the target must succeed on a DC 16 Constitution save or contract Rust Drake Lockjaw."
    },
    {
      "name": "Tail Swipe",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) bludgeoning damage."
    },
    {
      "name": "Vomits Scrap (Recharge 5-6)",
      "desc": "A rust drake can vomit forth a 15-foot cone of rusted metal. Targets in the affected area take 55 (10d10) slashing damage, or half damage with a successful DC 15 Dexterity saving throw. In addition, affected creatures must also make a successful DC 15 Constitution saving throw or contract Rust Drake Tetanus."
    },
    {
      "name": "Rust Drake Lockjaw",
      "desc": "This disease manifests symptoms in 1d4 days, when the affected creature experiences painful muscle spasms, particularly in the jaw. After each long rest, the creature must repeat the saving throw. If it fails, the victim takes 1d3 Dexterity damage and is paralyzed for 24 hours; if the saving throw succeeds, the creature takes no damage and feels well enough to act normally for the day. This continues until the creature dies from Dexterity loss, recovers naturally by making successful saving throws after two consecutive long rests, or is cured with lesser restoration or comparable magic. After the disease ends, the victim recovers 1d3 lost Dexterity with each long rest; greater restoration or comparable magic can restore it all at once."
    }
  ]
}