{
  "name": "Small Acid Elemental",
  "tags": [
    "small",
    "elemental",
    "cr3",
    "tome-of-horrors"
  ],
  "size": "Small",
  "type": "elemental",
  "alignment": "neutral",
  "cr": "3 (700 XP)",
  "hp": "60 (8d6 + 32)",
  "ac": "12",
  "speed": "20 ft., swim 80 ft.",
  "skills": "Stealth +6",
  "immunities": "acid, poison",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "darkvision 60 ft., passive perception 10",
  "languages": "--",
  "abilities": {
    "str": 21,
    "dex": 15,
    "con": 19,
    "int": 6,
    "wis": 11,
    "cha": 11
  },
  "traits": [
    {
      "name": "Acid",
      "desc": "A creature that touches the acid elemental or hits it with a melee attack while within 5 feet of it takes 5 (2d4) acid damage. Any nonmagical weapon made of metal or wood that hits the acid elemental corrodes. After dealing damage, the weapon takes a permanent and cumulative –1 penalty to damage rolls. If its penalty drops to –5, the weapon is destroyed. Nonmagical ammunition made of metal or wood that hits the acid elemental is destroyed after dealing damage. The acid elemental can eat through 2-inch-thick, nonmagical wood or metal in 1 round."
    },
    {
      "name": "Fumes",
      "desc": "Creatures who begin their turn within 5 feet of the acid elemental must succeed on a DC 15 Constitution saving throw or be poisoned until the start of their next turn. On a successful saving throw, the creature is immune to the elemental’s fumes for 24 hours."
    },
    {
      "name": "Vulnerability to Water",
      "desc": "For every 5 feet that the elemental moves in water, or for every gallon of water splashed on it, it takes 1 fire damage."
    }
  ],
  "actions": [
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) bludgeoning damage plus 7 (2d6) acid damage. In addition, nonmagical armor worn by the target is partly dissolved and takes a permanent and cumulative –1 penalty to the AC it offers. The armor is destroyed if the penalty reduces its AC to 10."
    }
  ]
}