{
  "name": "Sunbird Phoenix",
  "tags": [
    "gargantuan",
    "monstrosity",
    "cr13",
    "homebrew"
  ],
  "size": "Gargantuan",
  "type": "monstrosity",
  "alignment": "unaligned",
  "cr": "13 (10,000 XP)",
  "hp": "279 (18d20 + 90)",
  "ac": "17 (natural armor)",
  "speed": "20 ft., fly 120 ft.",
  "saves": "Dex +5, Con +10, Wis +7, Cha +7",
  "skills": "Perception +7",
  "immunities": "fire",
  "resistance": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "senses": "darkvision 120 ft., passive Perception 17",
  "languages": "Giant Owl, understands Common but can’t speak it",
  "abilities": {
    "str": 28,
    "dex": 10,
    "con": 20,
    "int": 13,
    "wis": 14,
    "cha": 15
  },
  "traits": [
    {
      "name": "Death Throes",
      "desc": "When the sunbird dies, it explodes, and each creature within 30 feet of it must make a DC 18 Dexterity saving throw, taking 42 (12d6) fire damage on a failed save, or half as much damage on a successful one. The explosion ignites flammable objects in that area that aren’t being worn or carried. The sunbird’s body turns to ash, but an egg is left where the sunbird was."
    },
    {
      "name": "Fire Aura",
      "desc": "At the start of each of the sunbird’s turns, each creature within 5 feet of it takes 11 (2d10) fire damage, and flammable objects in the area that aren’t being worn or carried ignite. A creature that touches the sunbird or hits it with a melee attack while within 5 feet of it takes 11 (2d10) fire damage. The aura also sheds bright light in a 60-foot radius and dim light for an additional 60 feet."
    },
    {
      "name": "Flyby",
      "desc": "The sunbird doesn’t provoke opportunity attacks when it flies out of an enemy’s reach."
    },
    {
      "name": "Keen Hearing and Sight",
      "desc": "The sunbird has advantage on Wisdom (Perception) checks that rely on hearing or sight."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The sunbird makes two talon attacks."
    },
    {
      "name": "Talon",
      "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 16 (2d6 + 9) slashing damage plus 14 (4d6) fire damage, and the target is grappled (escape DC 18). Until this grapple ends, the target is restrained, and the sunbird can’t attack another target with that talon. A grappled creature takes 11 (2d10) fire damage at the start of each of the sunbird’s turns."
    }
  ]
}