{
  "name": "The Ravager (Brawler Form)",
  "tags": [
    "gargantuan",
    "monstrosity",
    "cr30",
    "tome-of-horrors"
  ],
  "size": "Gargantuan",
  "type": "monstrosity",
  "alignment": "neutral",
  "cr": "30 (155,000 XP)",
  "hp": "738 (36d20 + 360)",
  "ac": "27 (natural armor)",
  "speed": "70 ft.",
  "saves": "Dex +15, Con +19",
  "skills": "Perception +16",
  "resistance": "acid, cold, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical weapons",
  "conimmunities": "charmed, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 120 ft., tremorsense 60 ft., passive Perception 26",
  "languages": "--",
  "abilities": {
    "str": 30,
    "dex": 23,
    "con": 30,
    "int": 6,
    "wis": 24,
    "cha": 23
  },
  "traits": [
    {
      "name": "Charge",
      "desc": "If the Ravager moves at least 20 feet straight toward a creature and then hits it with a claw attack on the same turn, the target must succeed on a DC 25 Strength saving throw or be knocked prone. If the target is prone, the Ravager can make one claw attack against it as a bonus action."
    },
    {
      "name": "Form-Shifting",
      "desc": "The Ravager can physically alter its physiology to take on one of the three listed forms: the crawler, the brawler, or the flier. Doing so takes one minute, and during this period it cannot take any other actions, though it is not considered incapacitated."
    },
    {
      "name": "Improved Critical",
      "desc": "The Ravager’s bite and claws score a critical hit on a roll of 19 or 20."
    },
    {
      "name": "Legendary Resistance (3/day)",
      "desc": "If the Ravager fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Magic Disruption",
      "desc": "Every time the Ravager comes into contact with magical effects, there is a chance that it disrupts it. This effect functions as per the dispel magic spell cast using a 7th level spell slot with a +7 spell casting ability modifier."
    },
    {
      "name": "Magic Weapons",
      "desc": "The Ravager’s melee attacks are magical."
    },
    {
      "name": "Rampage",
      "desc": "When the Ravager reduces a creature to 0 hit points with a melee attack on its turn, the Ravager can take a bonus action to move up to half its speed and make a bite attack."
    },
    {
      "name": "Regeneration",
      "desc": "The Ravager regains 15 hit points at the start of its turn. If the Ravager takes damage from an artifact or from a legendary action, this trait doesn’t function at the start of the Ravager’s next turn. The Ravager only dies if it starts its turn at 0 hit points and doesn’t regenerate."
    },
    {
      "name": "Vampiric Healing",
      "desc": "Whenever the Ravager hits with a melee attack, it regains hit points equal to half the damage it inflicts on its opponent, up to its hit point maximum."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The Ravager makes one bite and four claw attacks. It can also make a smash attack if it is grappling a creature."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 34 (7d6 + 10) piercing damage."
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +19 to hit, reach 15 ft., one target. Hit: 45 (10d6 + 10) slashing damage and the target is grappled (Escape DC 23). Until this grapple ends, the creature is restrained."
    },
    {
      "name": "Smash",
      "desc": "If a target is grappled at the beginning of its turn, the Ravager may smash it into the ground for 37 (6d8 + 10) bludgeoning damage."
    }
  ],
  "legendary": [
    {
      "name": "Attack",
      "desc": "The Ravager makes one claw or bite attack."
    },
    {
      "name": "Move",
      "desc": "The Ravager moves up to half of its speed."
    },
    {
      "name": "Charge (Costs 2 Actions)",
      "desc": "The Ravager charges at a target of its choice and makes one claw attack."
    }
  ]
}