{
  "name": "Umbral Eye Killer",
  "tags": [
    "medium",
    "monstrosity",
    "cr5",
    "tome-of-horrors"
  ],
  "size": "Medium",
  "type": "monstrosity",
  "alignment": "chaotic evil",
  "cr": "5 (1,800 XP)",
  "hp": "65 (10d8 + 20)",
  "ac": "13",
  "speed": "30 ft.",
  "skills": "Perception +6, Stealth +6",
  "senses": "darkvision 120 ft., passive Perception 16",
  "languages": "--",
  "abilities": {
    "str": 17,
    "dex": 16,
    "con": 14,
    "int": 2,
    "wis": 13,
    "cha": 12
  },
  "traits": [
    {
      "name": "Sunlight Vulnerability",
      "desc": "If a source of sunlight is brought within 5 feet of the eye killer, the eye killer becomes frightened for 1 minute. While frightened, the eye killer must end any grapple it is maintaining and use its action to Dash away from the source of sunlight."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The umbral eye killer’s innate spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). It can cast the following without material components. * 3/day: <i>darkness</i>"
    },
    {
      "name": "See in Darkness",
      "desc": "The umbral eye killer can see in magical and nonmagical darkness."
    }
  ],
  "actions": [
    {
      "name": "Tail Slap",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 14 (2d10 + 3) bludgeoning damage and the target is grappled (escape DC 13). At the beginning of each of the eye killer’s turns, a grappled creature takes 14 (2d10 + 3) bludgeoning damage."
    },
    {
      "name": "Death Ray (1/day)",
      "desc": "If the eye killer begins its turn within an area of bright light or dim light, it can immediately douse that source of light if it is created by a spell of 3rd level or lower. When it does so, it absorbs and redirects the light in a 60-foot line that is 5 feet across. Creatures in the area must make a DC 13 Dexterity saving throw. On a failed saving throw, the target drops to 0 hit points and begins dying. On a successful saving throw, the target takes 10 (3d6) radiant damage."
    }
  ]
}