{
  "name": "Virtue",
  "tags": [
    "medium",
    "celestial",
    "cr7",
    "strongholds-and-followers"
  ],
  "size": "Medium",
  "type": "celestial",
  "alignment": "any good alignment",
  "cr": "7 (2,900 XP)",
  "hp": "97 (13d8 + 39)",
  "ac": "15 (natural armor)",
  "speed": "0 ft., fly 40 ft. (hover)",
  "saves": "Int +6, Wis +6, Cha +8",
  "immunities": "necrotic, poison",
  "resistance": "radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
  "conimmunities": " charmed, exhaustion, frightened, poisoned",
  "senses": "truesight 60 ft., passive Perception 19",
  "languages": "all, telepathy 60 ft.",
  "abilities": {
    "str": 14,
    "dex": 13,
    "con": 16,
    "int": 16,
    "wis": 17,
    "cha": 20
  },
  "traits": [
    {
      "name": "Magic Resistance",
      "desc": "The Virtue has advantage on saving throws against spells and other magical effects from evil characters and sources."
    },
    {
      "name": "Aura of Protection Against Evil",
      "desc": "Evil creatures have disadvantage on attack rolls against all allies within 5 feet of the Virtue. Allies in this area can’t be charmed, frightened, or possessed by evil creatures. If an ally is already charmed, frightened, or possessed by evil magic, the ally has advantage on any new saving throw against the relevant effect."
    }
  ],
  "actions": [
    {
      "name": "Sing",
      "desc": "At the start of each of its turns, the Virtue chooses a chorus below and sings it. Only creatures who can hear the Virtue are affected by its chorus. It can only sing one chorus at a time. Any damage it takes forces it to make a Constitution saving throw to maintain the chorus. The DC equals 10 or half the damage taken, whichever number is higher. * ***Chorus of Succor.*** While the Virtue sings, each ally may choose one condition they’re suffering from at the start of their turn and end it. * ***Chorus of Inspiration.*** While the Virtue sings, each ally may add a d6 to the result of any attack roll or saving throw, once per round. The ally can wait until after they roll the d20 before deciding to use the inspiration die, but must decide before the GM says whether the roll succeeds or fails. * ***Chorus of Retribution.*** While the Virtue sings, any enemy who deals damage to one of the Virtue’s allies immediately takes 5 thunder damage. * ***Chorus of Damnation.*** While the Virtue sings, any extraplanar evil creatures have disadvantage on saving throws against spells that would send them to another plane."
    }
  ]
}