{
  "name": "Wind Goblin",
  "tags": [
    "small",
    "humanoid",
    "cr4",
    "tome-of-horrors"
  ],
  "size": "Small",
  "type": "humanoid",
  "alignment": "chaotic neutral",
  "cr": "4 (1,100 XP)",
  "hp": "36 (8d6 + 8)",
  "ac": "14",
  "speed": "20 ft., fly 40 ft.",
  "saves": "Int +7, Wis +3",
  "skills": "Arcana +7, Investigation +7",
  "immunities": "lightning",
  "resistance": "poison; bludgeoning, piercing, and slashing from nonmagical weapons",
  "vulnerability": "acid",
  "senses": "darkvision 120 ft., passive Perception 11",
  "languages": "Common, Goblin, Sylvan",
  "abilities": {
    "str": 13,
    "dex": 19,
    "con": 13,
    "int": 20,
    "wis": 13,
    "cha": 11
  },
  "traits": [
    {
      "name": "Innate Spellcasting",
      "desc": "The wind goblin’s spellcasting ability is Intelligence (spell save DC 15, +7 to hit with spell attacks). The wind goblin can innately cast the following spells, requiring no material components: * At will: <i>dancing lights, mage hand, prestidigitation, shocking grasp</i> * 3/day each: <i>detect magic, eldritch blast, faerie fire, gust of wind, identify</i> * 1/day: <i>wind wall, call lightning</i>"
    },
    {
      "name": "Scientific Spellcasting",
      "desc": "Wind goblins have a strange relationship with science and are able to use what they sincerely believe is scientific invention to mimic the abilities of spellcasters. They also describe arcane concepts in science-like jargon. The following is a typical allocation of “scientific”, gadget-based spells that a wind goblin might be able to cast, but specific spells vary from goblin to goblin. Wind goblin “science” magic never requires a verbal or material component. Instead, all spells require a gadget focus and the somatic component of turning the cranks and working the levers (etc.) on said focus. The process is usually loud and often smelly or smoky, with superfluous electrical arcing. The wind goblin is a 4th level spellcaster. Its spellcasting ability is Intelligence (spell save DC 15, +7 to hit with spell attacks). It can cast the following spells, requiring only somatic components: * Cantrips (at will): <i>fire bolt, light, mending, message, minor illusion</i> * 1st level (4/day\\*): <i>expeditious retreat, fog cloud, thunderwave</i> * 2nd level (3/day\\*): <i>hold person, knock</i> \\* The uses per day represent fuel-related limitations."
    }
  ],
  "actions": [
    {
      "name": "Dagger",
      "desc": "Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or 20/60 ft., one target. Hit: 6 (1d4 + 4) piercing damage."
    },
    {
      "name": "Hand Crossbow",
      "desc": "Ranged Weapon Attack: +6 to hit, range 30/120 ft., one target. Hit: 7 (1d6 + 4) piercing damage."
    }
  ]
}