{
  "name": "Yellow Musk Creeper",
  "tags": [
    "Medium",
    "plant",
    "cr2",
    "tomb-of-annihilation"
  ],
  "size": "Medium",
  "type": "plant",
  "alignment": "unaligned",
  "cr": "2 (450 XP)",
  "hp": "60 (11d8 +11)",
  "ac": "6",
  "speed": "5 ft., climb 5 ft.",
  "conimmunities": "blinded, deafeed, exhaustion, prone",
  "senses": "blindsight 30 ft., passive Perception 10",
  "abilities": {
    "str": 12,
    "dex": 3,
    "con": 12,
    "int": 1,
    "wis": 10,
    "cha": 3
  },
  "traits": [
    {
      "name": "False appearance",
      "desc": "While the creeper remains motionless, it is Indistinguishable from an ordinary flowering vine."
    },
    {
      "name": "Regeneration",
      "desc": "The creeper regains 10 hit points at the start of its turn. If the creeper takes fire, necrotic, or radiant damage, this trait doesn't function at the start of its next turn. The creeper dies only if it starts its turn with 0 hit points and doesn't regenerate."
    }
  ],
  "actions": [
    {
      "name": "Touch",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one creature. Hit: 13 (3d8) psychic damage. If the target is a humanoid that drops to 0 hit points as a result of th is damage, it dies and is implanted with a yellow musk creeper bulb. Unless the bulb is destroyed, the corpse animates as a yellow musk zombie after being dead for 24 hours. The bulb is destroyed if the creature is raised from the dead before it can transform into a yellow musk zombie, or if the corpse is targeted by a remove curse spell or similar magic before it animates."
    },
    {
      "name": "Yellow Musk (3/Day)",
      "desc": "The creeper's flowers release a strong musk that targets all humanoids within 30 feet of it. Each target must succeed on a DC 11 Wisdom saving throw or be charmed bythe creeper for 1 minute. A creature charmed in this way does nothing on its turn except move as close as it can to the creeper. A creature charmed by the creeper can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ]
}