{
  "name": "Zaratan",
  "tags": [
    "gargantuan",
    "monstrosity",
    "cr26",
    "tome-of-beasts"
  ],
  "size": "Gargantuan",
  "type": "monstrosity",
  "alignment": "unaligned",
  "cr": "26 (90000 XP)",
  "hp": "507 (26d20 + 234)",
  "ac": "25 (natural armor)",
  "speed": "10 ft., swim 50 ft.",
  "saves": "Int +8, Wis +8, Cha +8",
  "immunities": "cold, poison",
  "resistance": "fire, lightning, thunder; bludgeoning, piercing, slashing",
  "conimmunities": "frightened, paralyzed, poisoned",
  "senses": "blindsight 120 ft., passive Perception 10",
  "languages": "Aquan",
  "abilities": {
    "str": 30,
    "dex": 3,
    "con": 28,
    "int": 10,
    "wis": 11,
    "cha": 11
  },
  "traits": [
    {
      "name": "Fortified Shell",
      "desc": "The zaratan ignores any attack against its shell that doesn't do 30 points of damage or more. Attacking the zaratan's head or flippers bypasses this trait."
    },
    {
      "name": "Endless Breath",
      "desc": "The zaratan breathes air, but it can hold its breath for years."
    },
    {
      "name": "False Appearance",
      "desc": "While the zaratan remains motionless on the surface of the ocean (except for drifting) it is indistinguishable from a small island."
    },
    {
      "name": "Siege Monster",
      "desc": "The zaratan does double damage to objects and structures."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The zaratan makes one bite attack and two flipper attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +18 to hit, reach 10 ft., one target. Hit: 26 (3d10 + 10) piercing damage and the target is grappled (escape DC 20). Until the grapple ends, the target is restrained and the zaratan can't bite another target."
    },
    {
      "name": "Flipper",
      "desc": "Melee Weapon Attack: +18 to hit, reach 15 ft., one target. Hit: 19 (2d8 + 10) bludgeoning damage and the target must succeed on a DC 26 Strength saving throw or be pushed 10 feet away from the zaratan."
    },
    {
      "name": "Swallow",
      "desc": "The zaratan makes one bite attack against a Huge or smaller creature it is grappling. If the attack hits, the target takes 26 (3d10 + 10) piercing damage, is swallowed, and the grapple ends. A swallowed creature is blinded and restrained, but has total cover against attacks and effects outside the zaratan. A swallowed creature takes 28 (8d6) acid damage at the start of each of the zaratan's turns. The zaratan can have any number of creatures swallowed at once. If the zaratan takes 40 damage or more on a single turn from a creature inside it, the zaratan must succeed on a DC 20 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the zaratan. If the zaratan dies, swallowed creatures are no longer restrained and can escape by using 30 feet of movement, exiting prone."
    }
  ],
  "legendary": [
    {
      "name": "The zaratan can take 3 legendary actions, choosing from the options below",
      "desc": "Only one legendary action option can be used at a time and only at the end of another creature's turn. The zaratan regains spent legendary actions at the start of its turn."
    },
    {
      "name": "Move",
      "desc": "The zaratan moves up to half its speed."
    },
    {
      "name": "Swipe",
      "desc": "The zaratan makes one flipper attack."
    },
    {
      "name": "Consume (2 actions)",
      "desc": "The zaratan makes one bite attack or uses Swallow."
    }
  ]
}